[vlsi12@ece Desktop]$ cd EC1062
[vlsi12@ece EC1062]$ cd irfan_tra_ped_ctrl/
[vlsi12@ece irfan_tra_ped_ctrl]$ ls
10_floorplanning         2_tb         7_synthesis
11_powerplanning         3_sim        8_post_synthesis_LEC
12_placement             4_superlint  9_post_synthesis_GLS
13_clock_tree_synthesis  5_cdc_rdc
1_src                    6_xprop
[vlsi12@ece irfan_tra_ped_ctrl]$ cd 12_placement/
[vlsi12@ece 12_placement]$ csh
[vlsi12@ece 12_placement]$ source /home/vlsi12/c2s/cadence/install/cshrc


Welcome to Cadence tools Suite

[vlsi12@ece 12_placement]$ innovus

Cadence Innovus(TM) Implementation System.
Copyright 2021 Cadence Design Systems, Inc. All rights reserved worldwide.

Version:	v21.15-s110_1, built Fri Sep 23 13:08:12 PDT 2022
Options:	
Date:		Thu Oct  9 13:47:38 2025
Host:		ece.nitdgp.ac.in (x86_64 w/Linux 4.18.0-425.19.2.el8_7.x86_64) (4cores*4cpus*Intel(R) Xeon(R) CPU E5-1607 v3 @ 3.10GHz 10240KB)
OS:		Red Hat Enterprise Linux release 8.7 (Ootpa)

License:
		[13:47:38.275921] Configured Lic search path (21.01-s002): 5280@14.139.1.126

		invs	Innovus Implementation System	21.1	checkout succeeded
		8 CPU jobs allowed with the current license(s). Use setMultiCpuUsage to set your required CPU count.
Create and set the environment variable TMPDIR to /tmp/innovus_temp_5126_ece.nitdgp.ac.in_vlsi12_tXNSRp.

Change the soft stacksize limit to 0.2%RAM (15 mbytes). Set global soft_stack_size_limit to change the value.

**INFO:  MMMC transition support version v31-84 

[INFO] Loading PVS 22.20 fill procedures
innovus 1> Suppress "**WARN ..." messages.

Usage: read_db [-help] [-dynamic_view <string>] [-hold_views <string>]
               [-leakage_view <string>] [-no_timing] [-read_globals <string>]
               [-setup_views <string>] {[<in_dir> [-mmmc_file <string>] [-lef_files <list_of_files>] ] | [-oa_lib_cell_view {<libname> <cellname> <viewname>} [-mmmc_file <string>]]} [ -no_timing_graph ]

**ERROR: (IMPTCM-48):	"command" is not a legal option for command "read_db". Either the current option or an option prior to it is not specified correctly.
**ERROR: (IMPSYT-6300):	Failed to execute command 'read_db'. For more details, refer to error message:   
innovus 1> Un-suppress "**WARN ..." messages.
Suppress "**WARN ..." messages.
#% Begin load design ... (date=10/09 13:48:33, mem=1013.1M)
Loading design 'top' saved by 'Innovus' '21.15-s110_1' on 'Thu Oct 9 13:33:10 2025'.
% Begin Load MMMC data ... (date=10/09 13:48:33, mem=1015.4M)
% End Load MMMC data ... (date=10/09 13:48:33, total cpu=0:00:00.0, real=0:00:00.0, peak res=1016.1M, current mem=1016.1M)

Loading LEF file /home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/11_powerplanning/top_powerplan.dat/libs/lef/tsl180l4.lef ...

Loading LEF file /home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/11_powerplanning/top_powerplan.dat/libs/lef/tsl18fs120_scl.lef ...
Set DBUPerIGU to M2 pitch 560.

Loading LEF file /home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/11_powerplanning/top_powerplan.dat/libs/lef/tsl18cio250_4lm.lef ...
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.
Type 'man IMPLF-200' for more detail.

##  Check design process and node:  
##  Both design process and tech node are not set.

Loading view definition file from /home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/11_powerplanning/top_powerplan.dat/viewDefinition.tcl
Reading my_max_library_set timing library '/home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib' ...
Both ff/latch and statetable are present in cell 'lanht4'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib, Line 104953)
Both ff/latch and statetable are present in cell 'lanht2'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib, Line 157476)
Both ff/latch and statetable are present in cell 'lanht1'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib, Line 288762)
Read 534 cells in library 'tsl18fs120_scl_ss' 
Reading my_max_library_set timing library '/home/vlsi12/Downloads/scl_pdk/iolib/cio250/synopsys/2002.05/models/tsl18cio250_max.lib' ...
Read 93 cells in library 'tsl18cio250_max' 
Reading my_min_library_set timing library '/home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ff/tsl18fs120_scl_ff.lib' ...
Both ff/latch and statetable are present in cell 'lanht4'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ff/tsl18fs120_scl_ff.lib, Line 104965)
Both ff/latch and statetable are present in cell 'lanht2'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ff/tsl18fs120_scl_ff.lib, Line 157496)
Both ff/latch and statetable are present in cell 'lanht1'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ff/tsl18fs120_scl_ff.lib, Line 288805)
Read 534 cells in library 'tsl18fs120_scl_ff' 
Reading my_min_library_set timing library '/home/vlsi12/Downloads/scl_pdk/iolib/cio250/synopsys/2002.05/models/tsl18cio250_min.lib' ...
Read 93 cells in library 'tsl18cio250_min' 
*** End library_loading (cpu=0.02min, real=0.03min, mem=38.9M, fe_cpu=0.42min, fe_real=0.95min, fe_mem=1118.5M) ***
% Begin Load netlist data ... (date=10/09 13:48:35, mem=1041.2M)
*** Begin netlist parsing (mem=1118.5M) ***
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Type 'man IMPVL-159' for more detail.
Pin 'VDD' of cell 'pvdi' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VDDC' of cell 'pvdc' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VDDO' of cell 'pvda' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VSS' of cell 'pv0i' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VSS' of cell 'pv0f' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VSSC' of cell 'pv0c' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VSSO' of cell 'pv0a' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'AVDD' of cell 'apvdi' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'AVDDO' of cell 'apvda' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'AVSS' of cell 'apv0i' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'AVSSO' of cell 'apv0a' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Created 627 new cells from 4 timing libraries.
Reading netlist ...
Backslashed names will retain backslash and a trailing blank character.
Reading verilogBinary netlist '/home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/11_powerplanning/top_powerplan.dat/top.v.bin'

*** Memory Usage v#1 (Current mem = 1124.461M, initial mem = 483.879M) ***
*** End netlist parsing (cpu=0:00:00.0, real=0:00:00.0, mem=1124.5M) ***
% End Load netlist data ... (date=10/09 13:48:35, total cpu=0:00:00.0, real=0:00:00.0, peak res=1060.1M, current mem=1060.1M)
Top level cell is top.
Hooked 1254 DB cells to tlib cells.
Starting recursive module instantiation check.
No recursion found.
Building hierarchical netlist for Cell top ...
*** Netlist is unique.
** info: there are 1285 modules.
** info: there are 33 stdCell insts.
** info: there are 8 Pad insts.

*** Memory Usage v#1 (Current mem = 1168.875M, initial mem = 483.879M) ***
*info: set bottom ioPad orient R0
**ERROR: (IMPSYUTIL-96):	Cannot open (for read) FE IO file file: '/home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/11_powerplanning/top_powerplan.dat/libs/iofile/padframe.io'. The reason is: No such file or directory
Type 'man IMPSYUTIL-96' for more detail.


ERROR: 


    while executing
"error $catchMsg"
    (procedure "restoreDesign" line 33)



ERROR : The software requires that designs with timing library information be properly initialized into 
        a multi-mode/multi-corner (MMMC) environment. An error has occurred that has prevented proper initialization
        You should review your design import configuration to make sure all file references are valid and
        the MMMC configuration is correct and complete.



*** Memory Usage v#1 (Current mem = 1168.875M, initial mem = 483.879M) ***
*** Message Summary: 1485 warning(s), 4 error(s)

--- Ending "Innovus" (totcpu=0:00:25.4, real=0:00:57.0, mem=1168.9M) ---

[vlsi12@ece 12_placement]$ innovus

Cadence Innovus(TM) Implementation System.
Copyright 2021 Cadence Design Systems, Inc. All rights reserved worldwide.

Version:	v21.15-s110_1, built Fri Sep 23 13:08:12 PDT 2022
Options:	
Date:		Thu Oct  9 13:48:52 2025
Host:		ece.nitdgp.ac.in (x86_64 w/Linux 4.18.0-425.19.2.el8_7.x86_64) (4cores*4cpus*Intel(R) Xeon(R) CPU E5-1607 v3 @ 3.10GHz 10240KB)
OS:		Red Hat Enterprise Linux release 8.7 (Ootpa)

License:
		[13:48:53.275905] Configured Lic search path (21.01-s002): 5280@14.139.1.126

		invs	Innovus Implementation System	21.1	checkout succeeded
		8 CPU jobs allowed with the current license(s). Use setMultiCpuUsage to set your required CPU count.
Create and set the environment variable TMPDIR to /tmp/innovus_temp_6189_ece.nitdgp.ac.in_vlsi12_wQLwIP.

Change the soft stacksize limit to 0.2%RAM (15 mbytes). Set global soft_stack_size_limit to change the value.

**INFO:  MMMC transition support version v31-84 

[INFO] Loading PVS 22.20 fill procedures
innovus 1> **ERROR: (IMPSYT-16005):	Failed to open io file padframe.io.
**ERROR: (IMPSYT-6284):	Failed to open file viewDefinition.tcl for read.
**ERROR: (IMPSYT-16038):	The specified file 'libs/tsl180l4.lef' could not be found. Check your file system, correct the file name.
**ERROR: (IMPSYT-16038):	The specified file 'libs/tsl18fs120_scl.lef' could not be found. Check your file system, correct the file name.
**ERROR: (IMPSYT-16038):	The specified file 'libs/tsl18cio250_4lm.lef' could not be found. Check your file system, correct the file name.
**ERROR: (IMPIMEX-7327):	The file 'libs/tsl180l4.lef libs/tsl18fs120_scl.lef libs/tsl18cio250_4lm.lef' from the init_lef_file variable does not exist or does not have read permissions, so it can't be loaded. If the missing file has LEF data needed by the netlist, a fatal error may occur later when reading the netlist. You should correct the filename to avoid this warning message. 
Note, the setImportMode -treatUndefinedCellAsBbox option controls if an undefined modules is treated as a black-boxes, and setCheckMode -tapeOut controls if an undefined module (not converted to a blackbox) is treated as a fatal error or empty module when reading the netlist.
innovus 1> #% Begin Load MMMC data ... (date=10/09 13:52:13, mem=992.0M)
#% End Load MMMC data ... (date=10/09 13:52:13, total cpu=0:00:00.0, real=0:00:00.0, peak res=992.7M, current mem=992.7M)

Loading LEF file ../10_floorplanning/libs/tsl180l4.lef ...

Loading LEF file ../10_floorplanning/libs/tsl18fs120_scl.lef ...
Set DBUPerIGU to M2 pitch 560.

Loading LEF file ../10_floorplanning/libs/tsl18cio250_4lm.lef ...
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'apc3d01' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b01' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b01d' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b01u' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b02' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b02d' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b02u' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b03' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b03d' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b03ed' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b03u' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b04' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b04d' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b04u' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b05' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b05d' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b05u' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b21eu' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3b25eu' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (IMPLF-200):	Pin 'PAD' in macro 'pc3d00' has no ANTENNAGATEAREA value defined. The library data is incomplete and some process antenna rules will not be checked correctly.
Type 'man IMPLF-200' for more detail.
**WARN: (EMS-27):	Message (IMPLF-200) has exceeded the current message display limit of 20.
To increase the message display limit, refer to the product command reference manual.

##  Check design process and node:  
##  Both design process and tech node are not set.

Loading view definition file from ../10_floorplanning/viewDefinition.tcl
Reading my_max_library_set timing library '/home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib' ...
Both ff/latch and statetable are present in cell 'lanht4'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib, Line 104953)
Both ff/latch and statetable are present in cell 'lanht2'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib, Line 157476)
Both ff/latch and statetable are present in cell 'lanht1'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib, Line 288762)
Read 534 cells in library 'tsl18fs120_scl_ss' 
Reading my_max_library_set timing library '/home/vlsi12/Downloads/scl_pdk/iolib/cio250/synopsys/2002.05/models/tsl18cio250_max.lib' ...
Read 93 cells in library 'tsl18cio250_max' 
Reading my_min_library_set timing library '/home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ff/tsl18fs120_scl_ff.lib' ...
Both ff/latch and statetable are present in cell 'lanht4'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ff/tsl18fs120_scl_ff.lib, Line 104965)
Both ff/latch and statetable are present in cell 'lanht2'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ff/tsl18fs120_scl_ff.lib, Line 157496)
Both ff/latch and statetable are present in cell 'lanht1'. Only ff/latch will be used to model sequential cell behavior and statetable will be ignored (File /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/liberty/lib_flow_ff/tsl18fs120_scl_ff.lib, Line 288805)
Read 534 cells in library 'tsl18fs120_scl_ff' 
Reading my_min_library_set timing library '/home/vlsi12/Downloads/scl_pdk/iolib/cio250/synopsys/2002.05/models/tsl18cio250_min.lib' ...
Read 93 cells in library 'tsl18cio250_min' 
*** End library_loading (cpu=0.02min, real=0.02min, mem=35.4M, fe_cpu=1.02min, fe_real=3.38min, fe_mem=1118.9M) ***
#% Begin Load netlist data ... (date=10/09 13:52:15, mem=1013.1M)
*** Begin netlist parsing (mem=1118.9M) ***
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'aoim22d1' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'aoim22d1' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'or04d2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'or04d2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'an02d1' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'an02d1' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'nd02da' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'nd02da' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'dl03d2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'dl03d2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'invtd7' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'invtd7' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'slnht2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'slnht2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'aoim22d2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'aoim22d2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'mffnrb2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'mffnrb2' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VDD' of cell 'nr03d7' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (IMPVL-159):	Pin 'VSS' of cell 'nr03d7' is defined in LEF but not in the timing library.
Type 'man IMPVL-159' for more detail.
**WARN: (EMS-27):	Message (IMPVL-159) has exceeded the current message display limit of 20.
To increase the message display limit, refer to the product command reference manual.
Pin 'VDD' of cell 'pvdi' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VDDC' of cell 'pvdc' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VDDO' of cell 'pvda' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VSS' of cell 'pv0i' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VSS' of cell 'pv0f' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VSSC' of cell 'pv0c' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'VSSO' of cell 'pv0a' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'AVDD' of cell 'apvdi' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'AVDDO' of cell 'apvda' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'AVSS' of cell 'apv0i' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Pin 'AVSSO' of cell 'apv0a' is declared as power/ground in LEF but as signal in timing library.  Treat it as power/ground.
Created 627 new cells from 4 timing libraries.
Reading netlist ...
Backslashed names will retain backslash and a trailing blank character.
Reading verilog netlist '../10_floorplanning/top_netlist.v'

*** Memory Usage v#1 (Current mem = 1118.867M, initial mem = 491.879M) ***
*** End netlist parsing (cpu=0:00:00.0, real=0:00:00.0, mem=1118.9M) ***
#% End Load netlist data ... (date=10/09 13:52:15, total cpu=0:00:00.0, real=0:00:00.0, peak res=1032.3M, current mem=1032.3M)
Top level cell is top.
Hooked 1254 DB cells to tlib cells.
Starting recursive module instantiation check.
No recursion found.
Building hierarchical netlist for Cell top ...
*** Netlist is unique.
** info: there are 1285 modules.
** info: there are 33 stdCell insts.
** info: there are 8 Pad insts.

*** Memory Usage v#1 (Current mem = 1173.281M, initial mem = 491.879M) ***
Reading IO assignment file "../10_floorplanning/padframe.io" ...
Adjusting Core to Left to: 0.3200. Core to Bottom to: 0.3200.
**WARN: (IMPFP-3961):	The techSite 'CO_MSTR_c' has no related standard cells in the LEF/OA library. The calculations for this site type cannot be made unless standard cell models of this type exist in the LEF/OA library. Ignore this warning if the SITE is not used by the library. Alternatively, remove the SITE definition for the LEF/OA library to avoid this message.
Type 'man IMPFP-3961' for more detail.
**WARN: (IMPFP-3961):	The techSite 'IOSite_c' has no related standard cells in the LEF/OA library. The calculations for this site type cannot be made unless standard cell models of this type exist in the LEF/OA library. Ignore this warning if the SITE is not used by the library. Alternatively, remove the SITE definition for the LEF/OA library to avoid this message.
Type 'man IMPFP-3961' for more detail.
Horizontal Layer M1 offset = 0 (derived)
Vertical Layer M2 offset = 280 (derived)
Start create_tracks
Generated pitch 0.56 in M3 is different from 0.84 defined in technology file in preferred direction.
Extraction setup Started 
Initializing multi-corner RC extraction with 1 active RC Corners ...
**WARN: (IMPEXT-2773):	The via resistance between layers M0 and M1 could not be determined from the LEF technology file because the via resistance specification is missing. A default of 4 Ohms will be used as via resistance between these layers.
Type 'man IMPEXT-2773' for more detail.
**WARN: (IMPEXT-2776):	The via resistance between layers M1 and M2 is not defined in the capacitance table file. The via resistance of 6 Ohms defined in the LEF technology file will be used as via resistance between these layers.
Type 'man IMPEXT-2776' for more detail.
**WARN: (IMPEXT-2776):	The via resistance between layers M2 and M3 is not defined in the capacitance table file. The via resistance of 6 Ohms defined in the LEF technology file will be used as via resistance between these layers.
Type 'man IMPEXT-2776' for more detail.
**WARN: (IMPEXT-2776):	The via resistance between layers M3 and M4 is not defined in the capacitance table file. The via resistance of 2.5 Ohms defined in the LEF technology file will be used as via resistance between these layers.
Type 'man IMPEXT-2776' for more detail.
**WARN: (IMPEXT-2766):	The sheet resistance for layer M1 is not defined in the cap table. Therefore, the LEF value 0.08 will be used instead. To avoid this message, update the relevant cap table to include the sheet resistance for the specified layer and read it back in.
**WARN: (IMPEXT-2766):	The sheet resistance for layer M2 is not defined in the cap table. Therefore, the LEF value 0.08 will be used instead. To avoid this message, update the relevant cap table to include the sheet resistance for the specified layer and read it back in.
**WARN: (IMPEXT-2766):	The sheet resistance for layer M3 is not defined in the cap table. Therefore, the LEF value 0.08 will be used instead. To avoid this message, update the relevant cap table to include the sheet resistance for the specified layer and read it back in.
**WARN: (IMPEXT-2766):	The sheet resistance for layer M4 is not defined in the cap table. Therefore, the LEF value 0.04 will be used instead. To avoid this message, update the relevant cap table to include the sheet resistance for the specified layer and read it back in.
Summary of Active RC-Corners : 
 
 Analysis View: my_analysis_view_setup
    RC-Corner Name        : my_rc_corner_worst
    RC-Corner Index       : 0
    RC-Corner Temperature : 25 Celsius
    RC-Corner Cap Table   : ''
    RC-Corner PreRoute Res Factor         : 1
    RC-Corner PreRoute Cap Factor         : 1
    RC-Corner PostRoute Res Factor        : 1 {1 1 1}
    RC-Corner PostRoute Cap Factor        : 1 {1 1 1}
    RC-Corner PostRoute XCap Factor       : 1 {1 1 1}
    RC-Corner PreRoute Clock Res Factor   : 1	[Derived from Cap Table]
    RC-Corner PreRoute Clock Cap Factor   : 1	[Derived from Cap Table]
    RC-Corner PostRoute Clock Cap Factor  : 1 {1 1 1} 	[Derived from postRoute_cap (effortLevel low)]
    RC-Corner PostRoute Clock Res Factor  : 1 {1 1 1} 	[Derived from postRoute_res (effortLevel low)]
    RC-Corner PostRoute Clock coupling capacitance Factor : 1 {1 1 1} 
 
 Analysis View: my_analysis_view_hold
    RC-Corner Name        : my_rc_corner_worst
    RC-Corner Index       : 0
    RC-Corner Temperature : 25 Celsius
    RC-Corner Cap Table   : ''
    RC-Corner PreRoute Res Factor         : 1
    RC-Corner PreRoute Cap Factor         : 1
    RC-Corner PostRoute Res Factor        : 1 {1 1 1}
    RC-Corner PostRoute Cap Factor        : 1 {1 1 1}
    RC-Corner PostRoute XCap Factor       : 1 {1 1 1}
    RC-Corner PreRoute Clock Res Factor   : 1	[Derived from Cap Table]
    RC-Corner PreRoute Clock Cap Factor   : 1	[Derived from Cap Table]
    RC-Corner PostRoute Clock Cap Factor  : 1 {1 1 1} 	[Derived from postRoute_cap (effortLevel low)]
    RC-Corner PostRoute Clock Res Factor  : 1 {1 1 1} 	[Derived from postRoute_res (effortLevel low)]
    RC-Corner PostRoute Clock coupling capacitance Factor : 1 {1 1 1} 
Updating RC grid for preRoute extraction ...
Initializing multi-corner resistance tables ...
*Info: initialize multi-corner CTS.
Reading timing constraints file '/home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/7_synthesis/top.sdc' ...
Current (total cpu=0:01:02, real=0:03:24, peak res=1313.6M, current mem=1313.6M)
**WARN: (TCLCMD-1461):	Skipped unsupported command: set_units (File /home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/7_synthesis/top.sdc, Line 9).

**WARN: (TCLCMD-1461):	Skipped unsupported command: set_units (File /home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/7_synthesis/top.sdc, Line 10).

top
INFO (CTE): Reading of timing constraints file /home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/7_synthesis/top.sdc completed, with 2 WARNING
Ending "Constraint file reading stats" (total cpu=0:00:00.0, real=0:00:00.0, peak res=1333.9M, current mem=1333.9M)
Current (total cpu=0:01:02, real=0:03:24, peak res=1333.9M, current mem=1333.9M)
Total number of combinational cells: 321
Total number of sequential cells: 203
Total number of tristate cells: 10
Total number of level shifter cells: 0
Total number of power gating cells: 0
Total number of isolation cells: 0
Total number of power switch cells: 0
Total number of pulse generator cells: 0
Total number of always on buffers: 0
Total number of retention cells: 0
List of usable buffers: bufbd7 buffd2 bufbdf buffda buffd3 bufbda buffd4 bufbd4 bufbd1 bufbd3 buffd7 buffd1 bufbd2
Total number of usable buffers: 13
List of unusable buffers:
Total number of unusable buffers: 0
List of usable inverters: inv0d2 inv0da invbda invbdk inv0d1 inv0d7 invbd4 inv0d0 invbd2 inv0d4 invbd7 invbdf
Total number of usable inverters: 12
List of unusable inverters:
Total number of unusable inverters: 0
List of identified usable delay cells: dl04d1 dl03d1 dl02d2 dl03d4 dl04d2 dl02d1 dl01d4 bufbdk dl04d4 dl02d4 dl01d2 dl01d1 dl03d2
Total number of identified usable delay cells: 13
List of identified unusable delay cells:
Total number of identified unusable delay cells: 0
innovus 1> 
innovus 1> floorPlan -site CoreSite -noSnapToGrid -d 780 780 20 20 20 20
**WARN: (IMPFP-3961):	The techSite 'CO_MSTR_c' has no related standard cells in the LEF/OA library. The calculations for this site type cannot be made unless standard cell models of this type exist in the LEF/OA library. Ignore this warning if the SITE is not used by the library. Alternatively, remove the SITE definition for the LEF/OA library to avoid this message.
Type 'man IMPFP-3961' for more detail.
**WARN: (IMPFP-3961):	The techSite 'IOSite_c' has no related standard cells in the LEF/OA library. The calculations for this site type cannot be made unless standard cell models of this type exist in the LEF/OA library. Ignore this warning if the SITE is not used by the library. Alternatively, remove the SITE definition for the LEF/OA library to avoid this message.
Type 'man IMPFP-3961' for more detail.
Horizontal Layer M1 offset = 0 (derived)
Vertical Layer M2 offset = 280 (derived)
Start create_tracks
Generated pitch 0.56 in M3 is different from 0.84 defined in technology file in preferred direction.
**WARN: (IMPFP-325):	Floorplan of the design is resized. All current floorplan objects are automatically derived based on specified new floorplan. This may change blocks, fixed standard cells, existing routes and blockages.
innovus 2> addIoFiller -cell pfeed10000 -prefix FILLER -side n
Added 8 of filler cell 'pfeed10000' on top side.
innovus 3> addIoFiller -cell pfeed10000 -prefix FILLER -side e
Added 8 of filler cell 'pfeed10000' on right side.
innovus 4> addIoFiller -cell pfeed10000 -prefix FILLER -side w
Added 8 of filler cell 'pfeed10000' on left side.
innovus 5> addIoFiller -cell pfeed10000 -prefix FILLER -side s
Added 8 of filler cell 'pfeed10000' on bottom side.
innovus 6> addIoFiller -cell pfeed01000 -prefix FILLER -side n
Added 5 of filler cell 'pfeed01000' on top side.
innovus 7> addIoFiller -cell pfeed01000 -prefix FILLER -side e
Added 5 of filler cell 'pfeed01000' on right side.
innovus 8> addIoFiller -cell pfeed01000 -prefix FILLER -side w
Added 5 of filler cell 'pfeed01000' on left side.
innovus 9> addIoFiller -cell pfeed01000 -prefix FILLER -side s
Added 5 of filler cell 'pfeed01000' on bottom side.
innovus 10> addIoFiller -cell pfeed00010 -prefix FILLER -side n
Added 0 of filler cell 'pfeed00010' on top side.
innovus 11> addIoFiller -cell pfeed00010 -prefix FILLER -side e
Added 0 of filler cell 'pfeed00010' on right side.
innovus 12> addIoFiller -cell pfeed00010 -prefix FILLER -side w
Added 0 of filler cell 'pfeed00010' on left side.
innovus 13> addIoFiller -cell pfeed00010 -prefix FILLER -side s
Added 0 of filler cell 'pfeed00010' on bottom side.
innovus 14> globalNetConnect VDD -type pgpin -pin VDD -override -verbose -netlistOverride
45 new pwr-pin connections were made to global net 'VDD'.
innovus 15> globalNetConnect VSS -type pgpin -pin VSS -override -verbose -netlistOverride
45 new gnd-pin connections were made to global net 'VSS'.
innovus 16> globalNetConnect VDDO -type pgpin -pin VDDO -override -verbose -netlistOverride
12 new pwr-pin connections were made to global net 'VDDO'.
innovus 17> globalNetConnect VSSO -type pgpin -pin VSSO -override -verbose -netlistOverride
12 new gnd-pin connections were made to global net 'VSSO'.
innovus 18> 
innovus 18> 
innovus 18> addRing -skip_via_on_wire_shape Noshape -exclude_selected 1 -skip_via_on_pin Standardcell -center 1 -stacked_via_top_layer TOP_M -type core_rings -jog_distance 0.56 -threshold 0.56 -nets {VDD VSS} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right TOP_M left TOP_M} -width 6 -spacing 2 -offset 2
#% Begin addRing (date=10/09 13:56:09, mem=1146.8M)
**WARN: (IMPPP-4022):	Option "-stacked_via_top_layer" is obsolete and has been replaced by "setAddRingMode -stacked_via_top_layer". The obsolete option still works in this release, but to avoid this warning and to ensure compatibility with future releases, update your script to use "setAddRingMode -stacked_via_top_layer layerName"..
**WARN: (IMPPP-4022):	Option "-stacked_via_bottom_layer" is obsolete and has been replaced by "setAddRingMode -stacked_via_bottom_layer". The obsolete option still works in this release, but to avoid this warning and to ensure compatibility with future releases, update your script to use "setAddRingMode -stacked_via_bottom_layer layerName"..


viaInitial starts at Thu Oct  9 13:56:09 2025
viaInitial ends at Thu Oct  9 13:56:09 2025
Loading cell geometries (cpu: 0:00:00.0, real: 0:00:00.0, peak mem: 1514.3M)
Ring generation is complete.
vias are now being generated.
addRing created 8 wires.
ViaGen created 8 vias, deleted 0 via to avoid violation.
+--------+----------------+----------------+
|  Layer |     Created    |     Deleted    |
+--------+----------------+----------------+
|   M3   |        4       |       NA       |
|  TOP_V |        8       |        0       |
|  TOP_M |        4       |       NA       |
+--------+----------------+----------------+
#% End addRing (date=10/09 13:56:09, total cpu=0:00:00.0, real=0:00:00.0, peak res=1152.4M, current mem=1152.4M)
innovus 19> 
innovus 19> sroute -connect { blockPin padPin padRing corePin floatingStripe } -layerChangeRange { M1 TOP_M } -blockPinTarget { nearestTarget } -padPinPortConnect { allPort oneGeom } -padPinTarget { nearestTarget } -corePinTarget { firstAfterRowEnd } -floatingStripeTarget { blockring padring ring stripe ringpin blockpin followpin } -allowJogging 1 -crossoverViaLayerRange { M1 TOP_M } -nets { VDD VSS } -allowLayerChange 1 -blockPin useLef -targetViaLayerRange { M1 TOP_M }
#% Begin sroute (date=10/09 13:56:09, mem=1152.4M)
*** Begin SPECIAL ROUTE on Thu Oct  9 13:56:09 2025 ***
SPECIAL ROUTE ran on directory: /home/vlsi12/Desktop/EC1062/irfan_tra_ped_ctrl/12_placement
SPECIAL ROUTE ran on machine: ece.nitdgp.ac.in (Linux 4.18.0-425.19.2.el8_7.x86_64 Xeon 3.10Ghz)

Begin option processing ...
srouteConnectPowerBump set to false
routeSelectNet set to "VDD VSS"
routeSpecial set to true
srouteBlockPin set to "useLef"
srouteBottomLayerLimit set to 1
srouteBottomTargetLayerLimit set to 1
srouteConnectConverterPin set to false
srouteCrossoverViaBottomLayer set to 1
srouteCrossoverViaTopLayer set to 4
srouteFloatingStripeTarget set to "blockring padring ring stripe ringpin blockpin followpin"
srouteFollowCorePinEnd set to 3
srouteJogControl set to "preferWithChanges differentLayer"
sroutePadPinAllPorts set to true
sroutePreserveExistingRoutes set to true
srouteRoutePowerBarPortOnBothDir set to true
srouteStopBlockPin set to "nearestTarget"
srouteTopLayerLimit set to 4
srouteTopTargetLayerLimit set to 4
End option processing: cpu: 0:00:00, real: 0:00:00, peak: 3042.00 megs.

Reading DB technology information...
Finished reading DB technology information.
Reading floorplan and netlist information...
Finished reading floorplan and netlist information.
Read in 8 layers, 4 routing layers, 1 overlap layer
Read in 550 macros, 23 used
Read in 82 components
  14 core components: 14 unplaced, 0 placed, 0 fixed
  64 pad components: 0 unplaced, 52 placed, 12 fixed
  4 other components: 0 unplaced, 0 placed, 4 fixed
Read in 8 logical pins
Read in 8 nets
Read in 4 special nets, 2 routed
Read in 76 terminals
2 nets selected.

Begin power routing ...
**WARN: (IMPSR-1254):	Unable to connect the specified objects, since block pins of the VDD net were not found in the design. Check netlist or change the parameter value to include block pins in the design.
**WARN: (IMPSR-1254):	Unable to connect the specified objects, since block pins of the VSS net were not found in the design. Check netlist or change the parameter value to include block pins in the design.
CPU time for VDD FollowPin 0 seconds
CPU time for VSS FollowPin 0 seconds
  Number of IO ports routed: 2
  Number of Block ports routed: 0
  Number of Stripe ports routed: 0
  Number of Core ports routed: 86
  Number of Pad ports routed: 0
  Number of Power Bump ports routed: 0
  Number of Pad Ring connections: 100
  Number of Followpin connections: 43
End power routing: cpu: 0:00:00, real: 0:00:00, peak: 3077.00 megs.



 Begin updating DB with routing results ...
 Updating DB with 5 via definition ...Extracting standard cell pins and blockage ...... 
Pin and blockage extraction finished


sroute post-processing starts at Thu Oct  9 13:56:10 2025
The viaGen is rebuilding shadow vias for net VSS.
sroute post-processing ends at Thu Oct  9 13:56:10 2025
sroute created 237 wires.
ViaGen created 255 vias, deleted 0 via to avoid violation.
+--------+----------------+----------------+
|  Layer |     Created    |     Deleted    |
+--------+----------------+----------------+
|   M1   |       131      |       NA       |
|   V2   |       86       |        0       |
|   M2   |       24       |       NA       |
|   V3   |       85       |        0       |
|   M3   |       58       |       NA       |
|  TOP_V |       84       |        0       |
|  TOP_M |       24       |       NA       |
+--------+----------------+----------------+
#% End sroute (date=10/09 13:56:10, total cpu=0:00:00.3, real=0:00:01.0, peak res=1182.0M, current mem=1182.0M)
innovus 20> 
innovus 20> addStripe -skip_via_on_wire_shape Noshape -block_ring_top_layer_limit TOP_M -max_same_layer_jog_length 0.88 -padcore_ring_bottom_layer_limit M3 -set_to_set_distance 40 -skip_via_on_pin Standardcell -stacked_via_top_layer TOP_M -padcore_ring_top_layer_limit TOP_M -spacing 0.46 -xleft_offset 10 -merge_stripes_value 0.56 -layer TOP_M -block_ring_bottom_layer_limit M3 -width 2 -nets {VDD VSS} -stacked_via_bottom_layer M1
#% Begin addStripe (date=10/09 13:56:12, mem=1181.7M)
**WARN: (IMPPP-4022):	Option "-stacked_via_top_layer" is obsolete and has been replaced by "setAddStripeMode -stacked_via_top_layer". The obsolete option still works in this release, but to avoid this warning and to ensure compatibility with future releases, update your script to use "setAddStripeMode -stacked_via_top_layer layerName"..
**WARN: (IMPPP-4022):	Option "-xleft_offset" is obsolete and has been replaced by "-start_offset". The obsolete option still works in this release, but to avoid this warning and to ensure compatibility with future releases, update your script to use "-start_offset"..
**WARN: (IMPPP-4022):	Option "-stacked_via_bottom_layer" is obsolete and has been replaced by "setAddStripeMode -stacked_via_bottom_layer". The obsolete option still works in this release, but to avoid this warning and to ensure compatibility with future releases, update your script to use "setAddStripeMode -stacked_via_bottom_layer layerName"..

Initialize fgc environment(mem: 1545.0M) ...  fail and won't use fgc to check drc(cpu: 0:00:00.0, real: 0:00:00.0, peak mem: 1545.0M)
Loading cell geometries (cpu: 0:00:00.0, real: 0:00:00.0, peak mem: 1545.0M)
Loading wires (cpu: 0:00:00.0, real: 0:00:00.0, peak mem: 1545.0M)
Loading via instances (cpu: 0:00:00.0, real: 0:00:00.0, peak mem: 1545.0M)
Starting stripe generation ...
Non-Default Mode Option Settings :
  NONE
Stripe generation is complete.
vias are now being generated.
addStripe created 12 wires.
ViaGen created 797 vias, deleted 0 via to avoid violation.
+--------+----------------+----------------+
|  Layer |     Created    |     Deleted    |
+--------+----------------+----------------+
|   V2   |       258      |        0       |
|   V3   |       258      |        0       |
|  TOP_V |       281      |        0       |
|  TOP_M |       12       |       NA       |
+--------+----------------+----------------+
#% End addStripe (date=10/09 13:56:12, total cpu=0:00:00.1, real=0:00:00.0, peak res=1181.7M, current mem=1181.0M)
innovus 21> setPlaceMode -fp false
innovus 22> placeDesign -noPrePlaceOpt
*** placeDesign #1 [begin] : totSession cpu/real = 0:01:31.0/0:08:36.9 (0.2), mem = 1546.1M
Extracting standard cell pins and blockage ...... 
Pin and blockage extraction finished
*** Starting placeDesign default flow ***
**INFO: Enable pre-place timing setting for timing analysis
Set Using Default Delay Limit as 101.
**WARN: (IMPDC-1629):	The default delay limit was set to 101. This is less than the default of 1000 and may result in inaccurate delay calculation for nets with a fanout higher than the setting.  If needed, the default delay limit may be adjusted by running the command 'set delaycal_use_default_delay_limit'.
Set Default Net Delay as 0 ps.
Set Default Net Load as 0 pF. 
Set Default Input Pin Transition as 1 ps.
**INFO: Analyzing IO path groups for slack adjustment
Effort level <high> specified for reg2reg_tmp.6189 path_group
AAE_INFO: opIsDesignInPostRouteState() is 0
AAE DB initialization (MEM=1597.91 CPU=0:00:00.0 REAL=0:00:00.0) 
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=1672.94)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq1) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb1) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 49
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=1830.55 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=1830.55 CPU=0:00:00.1 REAL=0:00:01.0)
**INFO: Disable pre-place timing setting for timing analysis
Set Using Default Delay Limit as 1000.
Set Default Net Delay as 1000 ps.
Set Default Input Pin Transition as 0.1 ps.
Set Default Net Load as 0.5 pF. 
*** ThreeLayerMode is automatically turned on for small designs with less than 4 layers.
ThreeLayerMode is on. Timing-driven placement option disabled.
Deleted 0 physical inst  (cell - / prefix -).
INFO: #ExclusiveGroups=0
INFO: There are no Exclusive Groups.
*** Starting "NanoPlace(TM) placement v#6 (mem=1813.0M)" ...
No user-set net weight.
Net fanout histogram:
2		: 17 (41.5%) nets
3		: 11 (26.8%) nets
4     -	14	: 13 (31.7%) nets
15    -	39	: 0 (0.0%) nets
40    -	79	: 0 (0.0%) nets
80    -	159	: 0 (0.0%) nets
160   -	319	: 0 (0.0%) nets
320   -	639	: 0 (0.0%) nets
640   -	1279	: 0 (0.0%) nets
1280  -	2559	: 0 (0.0%) nets
2560  -	5119	: 0 (0.0%) nets
5120+		: 0 (0.0%) nets
Options: clkGateAware pinGuide congEffort=auto gpeffort=medium 
#std cell=33 (0 fixed + 33 movable) #buf cell=0 #inv cell=4 #block=0 (0 floating + 0 preplaced)
#ioInst=68 #net=41 #term=139 #term/net=3.39, #fixedIo=68, #floatIo=0, #fixedPin=8, #floatPin=0
stdCell: 33 single + 0 double + 0 multi
Total standard cell length = 0.2559 (mm), area = 0.0014 (mm^2)
Average module density = 0.025.
Density for the design = 0.025.
       = stdcell_area 457 sites (1433 um^2) / alloc_area 17976 sites (56373 um^2).
Pin Density = 0.007733.
            = total # of pins 139 / total area 17976.
=== lastAutoLevel = 7 
**WARN: (IMPSP-9531):	Turning off clkGateAware when timingDriven is off
Iteration  1: Total net bbox = 2.557e+03 (1.54e+03 1.02e+03)
              Est.  stn bbox = 2.871e+03 (1.75e+03 1.12e+03)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1776.1M
Iteration  2: Total net bbox = 2.557e+03 (1.54e+03 1.02e+03)
              Est.  stn bbox = 2.871e+03 (1.75e+03 1.12e+03)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1776.1M
Iteration  3: Total net bbox = 1.904e+03 (1.13e+03 7.74e+02)
              Est.  stn bbox = 2.198e+03 (1.31e+03 8.83e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
Iteration  4: Total net bbox = 1.835e+03 (1.09e+03 7.44e+02)
              Est.  stn bbox = 2.116e+03 (1.27e+03 8.47e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
Iteration  5: Total net bbox = 1.692e+03 (1.01e+03 6.79e+02)
              Est.  stn bbox = 1.950e+03 (1.18e+03 7.65e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
Iteration  6: Total net bbox = 1.672e+03 (9.88e+02 6.84e+02)
              Est.  stn bbox = 1.917e+03 (1.15e+03 7.68e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
Iteration  7: Total net bbox = 1.785e+03 (1.08e+03 7.04e+02)
              Est.  stn bbox = 2.043e+03 (1.25e+03 7.95e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
Iteration  8: Total net bbox = 1.951e+03 (1.14e+03 8.08e+02)
              Est.  stn bbox = 2.222e+03 (1.31e+03 9.07e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
Iteration  9: Total net bbox = 1.998e+03 (1.19e+03 8.08e+02)
              Est.  stn bbox = 2.270e+03 (1.37e+03 9.05e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M

Iteration 10: Total net bbox = 2.069e+03 (1.25e+03 8.20e+02)
              Est.  stn bbox = 2.337e+03 (1.42e+03 9.17e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
Iteration 11: Total net bbox = 2.069e+03 (1.25e+03 8.20e+02)
              Est.  stn bbox = 2.337e+03 (1.42e+03 9.17e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
Iteration 12: Total net bbox = 2.069e+03 (1.25e+03 8.20e+02)
              Est.  stn bbox = 2.337e+03 (1.42e+03 9.17e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1778.6M
*** cost = 2.069e+03 (1.25e+03 8.20e+02) (cpu for global=0:00:00.2) real=0:00:01.0***
Solver runtime cpu: 0:00:00.1 real: 0:00:00.1
Core Placement runtime cpu: 0:00:00.1 real: 0:00:01.0
**WARN: (IMPSP-9025):	No scan chain specified/traced.
Type 'man IMPSP-9025' for more detail.
*** Starting refinePlace (0:01:33 mem=1778.6M) ***
Total net bbox length = 2.080e+03 (1.257e+03 8.226e+02) (ext = 1.018e+03)
Move report: Detail placement moves 33 insts, mean move: 1.83 um, max move: 25.92 um 
	Max move on inst (U_sync_ack_to_main_sync1_reg): (338.86, 393.02) --> (318.72, 398.80)
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 1802.6MB
Summary Report:
Instances move: 33 (out of 33 movable)
Instances flipped: 0
Mean displacement: 1.83 um
Max displacement: 25.92 um (Instance: U_sync_ack_to_main_sync1_reg) (338.855, 393.019) -> (318.72, 398.8)
	Length: 21 sites, height: 1 rows, site name: CoreSite, cell type: dfcrq1
Total net bbox length = 2.007e+03 (1.192e+03 8.151e+02) (ext = 1.026e+03)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 1802.6MB
*** Finished refinePlace (0:01:33 mem=1802.6M) ***
*** End of Placement (cpu=0:00:00.3, real=0:00:01.0, mem=1802.6M) ***
default core: bins with density > 0.750 =  0.00 % ( 0 / 25 )
Density distribution unevenness ratio = 71.621%
**INFO: Enable pre-place timing setting for timing analysis
Set Using Default Delay Limit as 101.
**WARN: (IMPDC-1629):	The default delay limit was set to 101. This is less than the default of 1000 and may result in inaccurate delay calculation for nets with a fanout higher than the setting.  If needed, the default delay limit may be adjusted by running the command 'set delaycal_use_default_delay_limit'.
Set Default Net Delay as 0 ps.
Set Default Net Load as 0 pF. 
**INFO: Analyzing IO path groups for slack adjustment
Effort level <high> specified for reg2reg_tmp.6189 path_group
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=1817.88)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq1) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb1) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 49
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=1853.09 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=1853.09 CPU=0:00:00.0 REAL=0:00:00.0)
**INFO: Disable pre-place timing setting for timing analysis
Set Using Default Delay Limit as 1000.
Set Default Net Delay as 1000 ps.
Set Default Net Load as 0.5 pF. 
Info: Disable timing driven in postCTS congRepair.

Starting congRepair ...
*** ThreeLayerMode is automatically turned on for small designs with less than 4 layers.
ThreeLayerMode is on. Timing-driven placement option disabled.
[NR-eGR] Num Prerouted Nets = 0  Num Prerouted Wires = 0
[NR-eGR] Read 41 nets ( ignored 0 )
[NR-eGR] There are 2 clock nets ( 0 with NDR ).
[NR-eGR] Layer group 1: route 41 net(s) in layer range [2, 4]
[NR-eGR] Early Global Route overflow of layer group 1: 0.04% H + 0.00% V. EstWL: 2.133600e+03um
[NR-eGR] Overflow after Early Global Route 0.00% H + 0.00% V
Early Global Route congestion estimation runtime: 0.03 seconds, mem = 1851.6M
Local HotSpot Analysis: normalized max congestion hotspot area = 0.00, normalized total congestion hotspot area = 0.00 (area is in unit of 4 std-cell row bins)
Skipped repairing congestion.
[NR-eGR]                Length (um)  Vias 
[NR-eGR] ---------------------------------
[NR-eGR]  M1     (1H)             0   133 
[NR-eGR]  M2     (2V)           905   204 
[NR-eGR]  M3     (3H)          1297     6 
[NR-eGR]  TOP_M  (4V)             2     0 
[NR-eGR] ---------------------------------
[NR-eGR]         Total         2204   343 
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Total half perimeter of net bounding box: 2007um
[NR-eGR] Total length: 2204um, number of vias: 343
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Total eGR-routed clock nets wire length: 363um, number of vias: 51
[NR-eGR] --------------------------------------------------------------------------
Early Global Route wiring runtime: 0.01 seconds, mem = 1851.6M
Tdgp not successfully inited but do clear! skip clearing
End of congRepair (cpu=0:00:00.0, real=0:00:00.0)
*** Finishing placeDesign default flow ***
***** Total cpu  0:0:2
***** Total real time  0:0:4
**placeDesign ... cpu = 0: 0: 2, real = 0: 0: 4, mem = 1795.6M **
Tdgp not successfully inited but do clear! skip clearing

*** Summary of all messages that are not suppressed in this session:
Severity  ID               Count  Summary                                  
WARNING   IMPMSMV-1810         6  Net %s, driver %s (cell %s) voltage %g d...
WARNING   IMPDC-1629           2  The default delay limit was set to %d. T...
WARNING   IMPSP-9531           1  Turning off clkGateAware when timingDriv...
WARNING   IMPSP-9025           1  No scan chain specified/traced.          
*** Message Summary: 10 warning(s), 0 error(s)

*** placeDesign #1 [finish] : cpu/real = 0:00:02.0/0:00:03.6 (0.6), totSession cpu/real = 0:01:33.1/0:08:40.5 (0.2), mem = 1795.6M
0
innovus 23> innovus 23> saveDesign top_placement
#% Begin save design ... (date=10/09 13:57:55, mem=1308.6M)
% Begin Save ccopt configuration ... (date=10/09 13:57:55, mem=1308.6M)
% End Save ccopt configuration ... (date=10/09 13:57:55, total cpu=0:00:00.0, real=0:00:00.0, peak res=1312.7M, current mem=1312.7M)
% Begin Save netlist data ... (date=10/09 13:57:55, mem=1315.4M)
Writing Binary DB to top_placement.dat/top.v.bin in single-threaded mode...
% End Save netlist data ... (date=10/09 13:57:55, total cpu=0:00:00.0, real=0:00:00.0, peak res=1315.9M, current mem=1315.9M)
Saving symbol-table file ...
Saving congestion map file top_placement.dat/top.route.congmap.gz ...
% Begin Save AAE data ... (date=10/09 13:57:56, mem=1316.5M)
Saving AAE Data ...
% End Save AAE data ... (date=10/09 13:57:56, total cpu=0:00:00.0, real=0:00:00.0, peak res=1317.4M, current mem=1317.4M)
Saving preference file top_placement.dat/gui.pref.tcl ...
Saving mode setting ...
Saving global file ...
% Begin Save floorplan data ... (date=10/09 13:57:56, mem=1321.4M)
Saving floorplan file ...
% End Save floorplan data ... (date=10/09 13:57:56, total cpu=0:00:00.0, real=0:00:00.0, peak res=1321.5M, current mem=1321.5M)
Saving PG file top_placement.dat/top.pg.gz, version#2, (Created by Innovus v21.15-s110_1 on Thu Oct  9 13:57:56 2025)
*** Completed savePGFile (cpu=0:00:00.0 real=0:00:01.0 mem=1799.2M) ***
Saving Drc markers ...
... No Drc file written since there is no markers found.
% Begin Save placement data ... (date=10/09 13:57:57, mem=1321.5M)
** Saving stdCellPlacement_binary (version# 2) ...
Save Adaptive View Pruning View Names to Binary file
% End Save placement data ... (date=10/09 13:57:57, total cpu=0:00:00.0, real=0:00:00.0, peak res=1322.0M, current mem=1322.0M)
% Begin Save routing data ... (date=10/09 13:57:57, mem=1322.0M)
Saving route file ...
*** Completed saveRoute (cpu=0:00:00.0 real=0:00:00.0 mem=1799.2M) ***
% End Save routing data ... (date=10/09 13:57:57, total cpu=0:00:00.0, real=0:00:00.0, peak res=1322.2M, current mem=1322.2M)
Saving property file top_placement.dat/top.prop
*** Completed saveProperty (cpu=0:00:00.0 real=0:00:00.0 mem=1802.2M) ***
% Begin Save power constraints data ... (date=10/09 13:57:57, mem=1328.5M)
% End Save power constraints data ... (date=10/09 13:57:57, total cpu=0:00:00.0, real=0:00:00.0, peak res=1328.5M, current mem=1328.5M)
Generated self-contained design top_placement.dat
#% End save design ... (date=10/09 13:57:57, total cpu=0:00:00.4, real=0:00:02.0, peak res=1348.6M, current mem=1330.0M)
*** Message Summary: 0 warning(s), 0 error(s)

0
innovus 24> setOptMode -fixCap true -fixTran true -fixFanoutLoad false
innovus 25> optDesign -preCTS
Executing: place_opt_design -opt
**INFO: User settings:
setExtractRCMode -engine                   preRoute
setDelayCalMode -engine                    aae
setDelayCalMode -ignoreNetLoad             false
setOptMode -fixCap                         true
setOptMode -fixFanoutLoad                  false
setOptMode -fixTran                        true
setPlaceMode -place_design_floorplan_mode  false
setAnalysisMode -analysisType              bcwc
setAnalysisMode -clkSrcPath                true
setAnalysisMode -clockPropagation          sdcControl

*** place_opt_design #1 [begin] : totSession cpu/real = 0:01:43.5/0:10:42.6 (0.2), mem = 1846.2M
No user sequential activity specified, applying default sequential activity of "0.2" for Dynamic Power reporting.
'set_default_switching_activity' finished successfully.
*** Starting GigaPlace ***
#optDebug: fT-E <X 2 3 1 0>
*** GlobalPlace #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:43.5/0:10:42.7 (0.2), mem = 1828.2M
*** GlobalPlace #1 [finish] (place_opt_design #1) : cpu/real = 0:00:00.0/0:00:00.0 (0.0), totSession cpu/real = 0:01:43.5/0:10:42.7 (0.2), mem = 1828.2M
Enable CTE adjustment.
**optDesign ... cpu = 0:00:00, real = 0:00:00, mem = 1323.4M, totSessionCpu=0:01:44 **
GigaOpt running with 1 threads.
*** InitOpt #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:43.5/0:10:42.8 (0.2), mem = 1828.2M
**INFO: setDesignMode -flowEffort standard -> setting 'setOptMode -allEndPoints true' for the duration of this command.
Updating RC grid for preRoute extraction ...
Initializing multi-corner resistance tables ...
AAE DB initialization (MEM=1821.55 CPU=0:00:00.0 REAL=0:00:00.0) 
Setting timing_disable_library_data_to_data_checks to 'true'.
Setting timing_disable_user_data_to_data_checks to 'true'.
**optDesign ... cpu = 0:00:01, real = 0:00:01, mem = 1332.6M, totSessionCpu=0:01:45 **
*** optDesign -preCTS ***
DRC Margin: user margin 0.0; extra margin 0.2
Setup Target Slack: user slack 0; extra slack 0.0
Hold Target Slack: user slack 0
**WARN: (IMPOPT-3195):	Analysis mode has changed.
Type 'man IMPOPT-3195' for more detail.
Multi-VT timing optimization disabled based on library information.
[NR-eGR] Started Early Global Route kernel ( Curr Mem: 1822.55 MB )
[NR-eGR] Num Prerouted Nets = 0  Num Prerouted Wires = 0
[NR-eGR] Read 41 nets ( ignored 0 )
[NR-eGR] There are 2 clock nets ( 0 with NDR ).
[NR-eGR] Layer group 1: route 41 net(s) in layer range [2, 4]
[NR-eGR] Early Global Route overflow of layer group 1: 0.04% H + 0.00% V. EstWL: 2.150400e+03um
[NR-eGR] Overflow after Early Global Route 0.00% H + 0.00% V
[NR-eGR]                Length (um)  Vias 
[NR-eGR] ---------------------------------
[NR-eGR]  M1     (1H)             0   133 
[NR-eGR]  M2     (2V)           912   209 
[NR-eGR]  M3     (3H)          1303     6 
[NR-eGR]  TOP_M  (4V)             2     0 
[NR-eGR] ---------------------------------
[NR-eGR]         Total         2217   348 
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Total half perimeter of net bounding box: 2007um
[NR-eGR] Total length: 2217um, number of vias: 348
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Total eGR-routed clock nets wire length: 362um, number of vias: 48
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Finished Early Global Route kernel ( CPU: 0.04 sec, Real: 0.04 sec, Curr Mem: 1823.55 MB )
Updating RC grid for preRoute extraction ...
Initializing multi-corner resistance tables ...
Extraction called for design 'top' of instances=101 and nets=53 using extraction engine 'preRoute' .
**WARN: (IMPEXT-3530):	The process node is not set. Use the command setDesignMode -process <process node> prior to extraction for maximum accuracy and optimal automatic threshold setting.
Type 'man IMPEXT-3530' for more detail.
PreRoute RC Extraction called for design top.
RC Extraction called in multi-corner(1) mode.
**WARN: (IMPEXT-6197):	The Cap table file is not specified. This will result in lower parasitic accuracy when using preRoute extraction or postRoute extraction with effort level 'low'. It is recommended to generate the Cap table file using the 'generateCapTbl' command and specify it before extraction using 'create_rc_corner/update_rc_corner -cap_table'.
Type 'man IMPEXT-6197' for more detail.
RCMode: PreRoute
      RC Corner Indexes            0   
Capacitance Scaling Factor   : 1.00000 
Resistance Scaling Factor    : 1.00000 
Clock Cap. Scaling Factor    : 1.00000 
Clock Res. Scaling Factor    : 1.00000 
Shrink Factor                : 1.00000
PreRoute extraction is honoring NDR/Shielding/ExtraSpace for clock nets.
Updating RC grid for preRoute extraction ...
Initializing multi-corner resistance tables ...
PreRoute RC Extraction DONE (CPU Time: 0:00:00.0  Real Time: 0:00:00.0  MEM: 1823.551M)
Starting delay calculation for Setup views
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=1838.13)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq1) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb1) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 49
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=1916.49 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=1916.49 CPU=0:00:00.1 REAL=0:00:01.0)
*** Done Building Timing Graph (cpu=0:00:00.1 real=0:00:01.0 totSessionCpu=0:01:46 mem=1908.5M)

------------------------------------------------------------------
             Initial Summary
------------------------------------------------------------------

Setup views included:
 my_analysis_view_setup 

+--------------------+---------+
|     Setup mode     |   all   |
+--------------------+---------+
|           WNS (ns):| -16.973 |
|           TNS (ns):|-110.929 |
|    Violating Paths:|    8    |
|          All Paths:|   39    |
+--------------------+---------+

+----------------+-------------------------------+------------------+
|                |              Real             |       Total      |
|    DRVs        +------------------+------------+------------------|
|                |  Nr nets(terms)  | Worst Vio  |  Nr nets(terms)  |
+----------------+------------------+------------+------------------+
|   max_cap      |      0 (0)       |   0.000    |      3 (3)       |
|   max_tran     |      0 (0)       |   0.000    |      6 (6)       |
|   max_fanout   |      0 (0)       |     0      |      3 (3)       |
|   max_length   |      0 (0)       |     0      |      0 (0)       |
+----------------+------------------+------------+------------------+

Density: 2.542%
------------------------------------------------------------------
**optDesign ... cpu = 0:00:03, real = 0:00:03, mem = 1382.7M, totSessionCpu=0:01:46 **
*** InitOpt #1 [finish] (place_opt_design #1) : cpu/real = 0:00:02.8/0:00:02.9 (1.0), totSession cpu/real = 0:01:46.3/0:10:45.7 (0.2), mem = 1881.8M
** INFO : this run is activating medium effort placeOptDesign flow
*** Starting optimizing excluded clock nets MEM= 1881.8M) ***
*info: No excluded clock nets to be optimized.
*** Finished optimizing excluded clock nets (CPU Time= 0:00:00.0  MEM= 1881.8M) ***
GigaOpt Checkpoint: Internal congRefineRouteType -preCTS -congThreshold 0.001 -rescheduleForCongestion  -aggressiveCongestionMode  -resetVeryShortNets -resetShortNets -useSpineBased -rescheduleForAdherence 
Begin: GigaOpt Route Type Constraints Refinement
*** CongRefineRouteType #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:46.3/0:10:45.7 (0.2), mem = 1881.8M
Updated routing constraints on 0 nets.
Bottom Preferred Layer:
    None
Via Pillar Rule:
    None
*** CongRefineRouteType #1 [finish] (place_opt_design #1) : cpu/real = 0:00:00.2/0:00:00.2 (1.0), totSession cpu/real = 0:01:46.5/0:10:45.9 (0.2), mem = 1964.6M
End: GigaOpt Route Type Constraints Refinement
The useful skew maximum allowed delay is: 0.3
*** SimplifyNetlist #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:46.6/0:10:46.0 (0.2), mem = 1964.6M
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.

Footprint cell information for calculating maxBufDist
*info: There are 13 candidate Buffer cells
*info: There are 11 candidate Inverter cells


Netlist preparation processing... 
Removed 0 instance
*info: Marking 0 isolation instances dont touch
*info: Marking 0 level shifter instances dont touch
*** SimplifyNetlist #1 [finish] (place_opt_design #1) : cpu/real = 0:00:01.7/0:00:01.7 (1.0), totSession cpu/real = 0:01:48.3/0:10:47.7 (0.2), mem = 1947.8M
Begin: GigaOpt high fanout net optimization
GigaOpt HFN: use maxLocalDensity 1.2
GigaOpt Checkpoint: Internal optDRV -useLevelizedBufferTreeOnly -auxMaxFanoutCountLimit 500 -largeScaleFixing -maxIter 1 -maxLocalDensity 1.2 -numThreads 1 -preCTS -preRouteDontEndWithRefinePlaceIncrSteinerRouteDC
*** DrvOpt #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:48.3/0:10:47.7 (0.2), mem = 1947.8M
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** DrvOpt #1 [finish] (place_opt_design #1) : cpu/real = 0:00:01.3/0:00:01.3 (1.0), totSession cpu/real = 0:01:49.7/0:10:49.0 (0.2), mem = 1948.0M
GigaOpt HFN: restore maxLocalDensity to 0.98
End: GigaOpt high fanout net optimization
Begin: GigaOpt DRV Optimization
GigaOpt Checkpoint: Internal optDRV -max_tran -max_cap -maxLocalDensity 1.2 -numThreads 1 -largeScaleFixing -maxIter 2 -preCTS -preRouteDontEndWithRefinePlaceIncrSteinerRouteDC
*** DrvOpt #2 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:49.7/0:10:49.0 (0.2), mem = 1948.0M
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
|        max-tran       |        max-cap        |  max-fanout |  max-length |       setup       |        |        |        |       |          |         |
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
| nets | terms|  wViol  | nets | terms|  wViol  | nets | terms| nets | terms|   WNS   |   TNS   |  #Buf  |  #Inv  | #Resize|Density|   Real   |   Mem   |
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
|     6|     6|   -43.13|     3|     3|    -3.15|     3|     3|     0|     0|   -16.97|  -110.93|       0|       0|       0|  2.54%|          |         |
|     6|     6|   -43.13|     3|     3|    -3.15|     3|     3|     0|     0|   -16.97|  -108.28|       1|       0|       0|  2.56%| 0:00:00.0|  2038.3M|
|     6|     6|   -43.13|     3|     3|    -3.15|     3|     3|     0|     0|   -16.97|  -108.28|       0|       0|       0|  2.56%| 0:00:00.0|  2038.3M|
+-------------------------------------------------------------------------------------------------------------------------------------------------------+


=======================================================================
                Reasons for remaining drv violations
=======================================================================
*info: Total 6 net(s) have violations which can't be fixed by DRV optimization.

MultiBuffering failure reasons
------------------------------------------------
*info:     3 net(s): Could not be fixed as the net is considered as IPO ignored by the process.


*** Finish DRV Fixing (cpu=0:00:00.0 real=0:00:00.0 mem=2038.3M) ***

*** DrvOpt #2 [finish] (place_opt_design #1) : cpu/real = 0:00:00.2/0:00:00.2 (1.0), totSession cpu/real = 0:01:49.9/0:10:49.3 (0.2), mem = 1962.2M
End: GigaOpt DRV Optimization
GigaOpt DRV: restore maxLocalDensity to 0.98
**optDesign ... cpu = 0:00:06, real = 0:00:06, mem = 1449.5M, totSessionCpu=0:01:50 **

Active setup views:
 my_analysis_view_setup
  Dominating endpoints: 0
  Dominating TNS: -0.000

Begin: GigaOpt Global Optimization
*info: use new DP (enabled)
GigaOpt Checkpoint: Internal globalOpt -maxLocalDensity 1.2 -numThreads 1 -preCTS -rebufferAll -preRouteDontEndWithRefinePlaceIncrSteinerRouteDC -enableHighLayerOpt -maxIter 50 -maxIterForLEPG 50
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** GlobalOpt #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:49.9/0:10:49.3 (0.2), mem = 2000.3M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Global Opt WNS Slack -16.973  TNS Slack -108.285 
+--------+--------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   |  TNS   | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+--------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -16.973|-108.285|    2.56%|   0:00:00.0| 2038.5M|my_analysis_view_setup|  default| traffic_light[0]                     |
| -16.973|-108.285|    2.56%|   0:00:00.0| 2038.5M|my_analysis_view_setup|  default| traffic_light[0]                     |
| -16.973|-108.285|    2.56%|   0:00:00.0| 2038.5M|my_analysis_view_setup|  default| traffic_light[0]                     |
| -16.973|-108.285|    2.56%|   0:00:00.0| 2038.5M|my_analysis_view_setup|  default| traffic_light[0]                     |
| -16.975| -45.600|    2.61%|   0:00:00.0| 2057.6M|my_analysis_view_setup|  default| traffic_light[0]                     |
| -16.975| -45.600|    2.61%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| traffic_light[0]                     |
| -16.975| -45.600|    2.61%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| traffic_light[0]                     |
| -16.975| -45.600|    2.61%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| traffic_light[0]                     |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
| -12.073| -12.373|    2.64%|   0:00:00.0| 2060.1M|my_analysis_view_setup|  default| walk                                 |
+--------+--------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish pre-CTS Global Setup Fixing (cpu=0:00:00.1 real=0:00:00.0 mem=2060.1M) ***

*** Finish pre-CTS Setup Fixing (cpu=0:00:00.1 real=0:00:00.0 mem=2060.1M) ***
** GigaOpt Global Opt End WNS Slack -12.073  TNS Slack -12.373 
*** GlobalOpt #1 [finish] (place_opt_design #1) : cpu/real = 0:00:01.6/0:00:01.6 (1.0), totSession cpu/real = 0:01:51.5/0:10:50.9 (0.2), mem = 1978.0M
End: GigaOpt Global Optimization
*** Timing NOT met, worst failing slack is -12.073
*** Check timing (0:00:00.0)
GigaOpt Checkpoint: Internal reclaim -numThreads 1 -preCTS -force -doRemoveUselessTerm -tgtSlackMult 3 -routeType -noRouteTypeResizePolish -noViewPrune -weedwhack -nonLegal -nativePathGroupFlow
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
Begin: Area Reclaim Optimization
*** AreaOpt #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:51.5/0:10:50.9 (0.2), mem = 2035.2M
Reclaim Optimization WNS Slack -12.073  TNS Slack -12.373 Density 2.64
+---------+---------+--------+--------+------------+--------+
| Density | Commits |  WNS   |  TNS   |    Real    |  Mem   |
+---------+---------+--------+--------+------------+--------+
|    2.64%|        -| -12.073| -12.373|   0:00:00.0| 2037.2M|
|    2.64%|        0| -12.073| -12.373|   0:00:00.0| 2037.2M|
|    2.64%|        0| -12.073| -12.373|   0:00:00.0| 2037.2M|
|    2.64%|        0| -12.073| -12.373|   0:00:00.0| 2037.2M|
|    2.61%|        1| -12.073| -12.396|   0:00:00.0| 2060.8M|
|    2.61%|        0| -12.073| -12.396|   0:00:00.0| 2060.8M|
|    2.61%|        0| -12.073| -12.396|   0:00:00.0| 2060.8M|
+---------+---------+--------+--------+------------+--------+
Reclaim Optimization End WNS Slack -12.073  TNS Slack -12.396 Density 2.61

Number of times islegalLocAvaiable called = 0 skipped = 0, called in commitmove = 0, skipped in commitmove = 0
End: Core Area Reclaim Optimization (cpu = 0:00:01.3) (real = 0:00:01.0) **
*** AreaOpt #1 [finish] (place_opt_design #1) : cpu/real = 0:00:01.3/0:00:01.3 (1.0), totSession cpu/real = 0:01:52.8/0:10:52.2 (0.2), mem = 2060.8M
Executing incremental physical updates
Executing incremental physical updates
End: Area Reclaim Optimization (cpu=0:00:01, real=0:00:01, mem=1980.77M, totSessionCpu=0:01:53).
*** IncrReplace #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:52.8/0:10:52.3 (0.2), mem = 1980.8M

*** Start incrementalPlace ***
*** ThreeLayerMode is automatically turned on for small designs with less than 4 layers.
ThreeLayerMode is on. Timing-driven placement option disabled.
No Views given, use default active views for adaptive view pruning
SKP will enable view:
  my_analysis_view_setup
[NR-eGR] Num Prerouted Nets = 0  Num Prerouted Wires = 0
[NR-eGR] Read 42 nets ( ignored 0 )
[NR-eGR] There are 2 clock nets ( 0 with NDR ).
[NR-eGR] Layer group 1: route 42 net(s) in layer range [2, 4]
[NR-eGR] Early Global Route overflow of layer group 1: 0.04% H + 0.00% V. EstWL: 2.156000e+03um
[NR-eGR] Overflow after Early Global Route 0.00% H + 0.00% V
Early Global Route congestion estimation runtime: 0.03 seconds, mem = 1982.8M
Local HotSpot Analysis: normalized max congestion hotspot area = 0.00, normalized total congestion hotspot area = 0.00 (area is in unit of 4 std-cell row bins)

=== incrementalPlace Internal Loop 1 ===
*** ThreeLayerMode is automatically turned on for small designs with less than 4 layers.
ThreeLayerMode is on. Timing-driven placement option disabled.
*** Finished SKP initialization (cpu=0:00:00.0, real=0:00:00.0)***
Iteration  5: Total net bbox = 1.672e+03 (1.01e+03 6.62e+02)
              Est.  stn bbox = 1.908e+03 (1.17e+03 7.39e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1957.7M
Iteration  6: Total net bbox = 1.670e+03 (9.80e+02 6.90e+02)
              Est.  stn bbox = 1.915e+03 (1.14e+03 7.74e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1957.7M
Iteration  7: Total net bbox = 1.751e+03 (1.05e+03 7.03e+02)
              Est.  stn bbox = 2.021e+03 (1.22e+03 8.05e+02)
              cpu = 0:00:00.0 real = 0:00:01.0 mem = 1957.7M
Iteration  8: Total net bbox = 1.937e+03 (1.09e+03 8.46e+02)
              Est.  stn bbox = 2.217e+03 (1.26e+03 9.54e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1957.7M
Iteration  9: Total net bbox = 1.984e+03 (1.12e+03 8.68e+02)
              Est.  stn bbox = 2.262e+03 (1.29e+03 9.76e+02)
              cpu = 0:00:00.0 real = 0:00:00.0 mem = 1957.7M
Move report: Timing Driven Placement moves 34 insts, mean move: 10.85 um, max move: 34.77 um 
	Max move on inst (granted_reg): (333.84, 370.80) --> (346.21, 393.20)

Finished Incremental Placement (cpu=0:00:00.2, real=0:00:01.0, mem=1957.7M)
**WARN: (IMPSP-9025):	No scan chain specified/traced.
Type 'man IMPSP-9025' for more detail.
*** Starting refinePlace (0:01:53 mem=1957.7M) ***
Total net bbox length = 2.119e+03 (1.241e+03 8.774e+02) (ext = 1.043e+03)
Move report: Detail placement moves 34 insts, mean move: 1.32 um, max move: 7.23 um 
	Max move on inst (g214__5122): (352.94, 371.37) --> (359.60, 370.80)
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 1957.7MB
Summary Report:
Instances move: 34 (out of 34 movable)
Instances flipped: 0
Mean displacement: 1.32 um
Max displacement: 7.23 um (Instance: g214__5122) (352.938, 371.366) -> (359.6, 370.8)
	Length: 5 sites, height: 1 rows, site name: CoreSite, cell type: nr03d1
Total net bbox length = 2.034e+03 (1.164e+03 8.694e+02) (ext = 1.059e+03)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 1957.7MB
*** Finished refinePlace (0:01:53 mem=1957.7M) ***
*** ThreeLayerMode is automatically turned on for small designs with less than 4 layers.
ThreeLayerMode is on. Timing-driven placement option disabled.
[NR-eGR] Num Prerouted Nets = 0  Num Prerouted Wires = 0
[NR-eGR] Read 42 nets ( ignored 0 )
[NR-eGR] There are 2 clock nets ( 0 with NDR ).
[NR-eGR] Layer group 1: route 42 net(s) in layer range [2, 4]
[NR-eGR] Early Global Route overflow of layer group 1: 0.04% H + 0.00% V. EstWL: 2.228800e+03um
[NR-eGR] Overflow after Early Global Route 0.00% H + 0.00% V
Early Global Route congestion estimation runtime: 0.03 seconds, mem = 1957.7M
Local HotSpot Analysis: normalized max congestion hotspot area = 0.00, normalized total congestion hotspot area = 0.00 (area is in unit of 4 std-cell row bins)
[NR-eGR]                Length (um)  Vias 
[NR-eGR] ---------------------------------
[NR-eGR]  M1     (1H)             0   135 
[NR-eGR]  M2     (2V)          1006   207 
[NR-eGR]  M3     (3H)          1258     6 
[NR-eGR]  TOP_M  (4V)             2     0 
[NR-eGR] ---------------------------------
[NR-eGR]         Total         2265   348 
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Total half perimeter of net bounding box: 2034um
[NR-eGR] Total length: 2265um, number of vias: 348
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Total eGR-routed clock nets wire length: 356um, number of vias: 48
[NR-eGR] --------------------------------------------------------------------------
Early Global Route wiring runtime: 0.01 seconds, mem = 1957.7M
0 delay mode for cte disabled.

*** Finished incrementalPlace (cpu=0:00:00.4, real=0:00:01.0)***
Start to check current routing status for nets...
All nets are already routed correctly.
End to check current routing status for nets (mem=1955.7M)
Extraction called for design 'top' of instances=102 and nets=54 using extraction engine 'preRoute' .
**WARN: (IMPEXT-3530):	The process node is not set. Use the command setDesignMode -process <process node> prior to extraction for maximum accuracy and optimal automatic threshold setting.
Type 'man IMPEXT-3530' for more detail.
PreRoute RC Extraction called for design top.
RC Extraction called in multi-corner(1) mode.
**WARN: (IMPEXT-6197):	The Cap table file is not specified. This will result in lower parasitic accuracy when using preRoute extraction or postRoute extraction with effort level 'low'. It is recommended to generate the Cap table file using the 'generateCapTbl' command and specify it before extraction using 'create_rc_corner/update_rc_corner -cap_table'.
Type 'man IMPEXT-6197' for more detail.
RCMode: PreRoute
      RC Corner Indexes            0   
Capacitance Scaling Factor   : 1.00000 
Resistance Scaling Factor    : 1.00000 
Clock Cap. Scaling Factor    : 1.00000 
Clock Res. Scaling Factor    : 1.00000 
Shrink Factor                : 1.00000
PreRoute extraction is honoring NDR/Shielding/ExtraSpace for clock nets.
Updating RC grid for preRoute extraction ...
Initializing multi-corner resistance tables ...
PreRoute RC Extraction DONE (CPU Time: 0:00:00.0  Real Time: 0:00:00.0  MEM: 1955.664M)
Compute RC Scale Done ...
**optDesign ... cpu = 0:00:10, real = 0:00:10, mem = 1444.2M, totSessionCpu=0:01:53 **
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=1954.79)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq4) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb4) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 50
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=1988.27 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=1988.27 CPU=0:00:00.0 REAL=0:00:00.0)
*** IncrReplace #1 [finish] (place_opt_design #1) : cpu/real = 0:00:00.5/0:00:00.5 (0.9), totSession cpu/real = 0:01:53.4/0:10:52.8 (0.2), mem = 1988.3M
*** Timing NOT met, worst failing slack is -12.075
*** Check timing (0:00:00.0)
Begin: GigaOpt Optimization in WNS mode
GigaOpt Checkpoint: Internal optTiming -maxLocalDensity 1.0 -maxLocalDensityForHardenOpt 0.92 -numThreads 1 -preCTS -wtns -integratedAreaOpt -pgMode all -ipoTgtSlackCoef 1.5 -effTgtSlackCoef 1 -nativePathGroupFlow -NDROptEffortAuto -usefulSkew -nonLegalPlaceEcoBumpRecoveryInWNSOpt
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** WnsOpt #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:53.4/0:10:52.8 (0.2), mem = 2004.3M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Optimizer WNS Slack -12.075 TNS Slack -12.749 Density 2.61
OptDebug: Start of Optimizer WNS Pass 0:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-12.075|-12.075|
|reg2reg   | -0.332| -0.675|
|HEPG      | -0.332| -0.675|
|All Paths |-12.075|-12.749|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.332|  -12.075|  -0.675|  -12.749|    2.61%|   0:00:00.0| 2039.3M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.081|  -12.075|  -0.140|  -12.215|    2.74%|   0:00:01.0| 2073.4M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.081|  -12.075|  -0.140|  -12.215|    2.74%|   0:00:00.0| 2073.4M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.4 real=0:00:01.0 mem=2073.4M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -12.075|  -12.075| -12.075|  -12.215|    2.74%|   0:00:00.0| 2073.4M|my_analysis_view_setup|  default| walk                                 |
| -11.944|  -11.944| -11.944|  -12.085|    2.74%|   0:00:00.0| 2073.4M|my_analysis_view_setup|  default| walk                                 |
| -11.944|  -11.944| -11.944|  -12.085|    2.74%|   0:00:00.0| 2073.4M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2073.4M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.5 real=0:00:01.0 mem=2073.4M) ***
OptDebug: End of Optimizer WNS Pass 0:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.081| -0.140|
|HEPG      | -0.081| -0.140|
|All Paths |-11.944|-12.085|
+----------+-------+-------+

** GigaOpt Optimizer WNS Slack -11.944 TNS Slack -12.085 Density 2.74
*** Starting refinePlace (0:01:55 mem=2073.4M) ***
Total net bbox length = 2.347e+03 (1.427e+03 9.201e+02) (ext = 9.079e+02)

Starting Small incrNP...
Skipped incrNP (cpu=0:00:00.0, real=0:00:00.0, mem=2073.4M)
End of Small incrNP (cpu=0:00:00.0, real=0:00:00.0)
Move report: Detail placement moves 6 insts, mean move: 3.83 um, max move: 6.16 um 
	Max move on inst (granted_reg): (346.16, 393.20) --> (352.32, 393.20)
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2073.4MB
Summary Report:
Instances move: 6 (out of 34 movable)
Instances flipped: 0
Mean displacement: 3.83 um
Max displacement: 6.16 um (Instance: granted_reg) (346.16, 393.2) -> (352.32, 393.2)
	Length: 37 sites, height: 1 rows, site name: CoreSite, cell type: decrq4
Total net bbox length = 2.380e+03 (1.466e+03 9.145e+02) (ext = 9.068e+02)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2073.4MB
*** Finished refinePlace (0:01:55 mem=2073.4M) ***
*** maximum move = 6.16 um ***
*** Finished re-routing un-routed nets (2073.4M) ***

*** Finish Physical Update (cpu=0:00:00.0 real=0:00:00.0 mem=2073.4M) ***
** GigaOpt Optimizer WNS Slack -11.944 TNS Slack -12.085 Density 2.74
OptDebug: Start of Optimizer WNS Pass 1:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.081| -0.140|
|HEPG      | -0.081| -0.140|
|All Paths |-11.944|-12.085|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.081|  -11.944|  -0.140|  -12.085|    2.74%|   0:00:00.0| 2073.4M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.081|  -11.944|  -0.140|  -12.085|    2.74%|   0:00:00.0| 2075.4M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.2 real=0:00:00.0 mem=2075.4M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.944|  -11.944| -11.944|  -12.085|    2.74%|   0:00:00.0| 2075.4M|my_analysis_view_setup|  default| walk                                 |
| -11.944|  -11.944| -11.944|  -12.085|    2.74%|   0:00:00.0| 2075.4M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2075.4M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.2 real=0:00:00.0 mem=2075.4M) ***
OptDebug: End of Optimizer WNS Pass 1:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.081| -0.140|
|HEPG      | -0.081| -0.140|
|All Paths |-11.944|-12.085|
+----------+-------+-------+

OptDebug: Start of Optimizer WNS Pass 2:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.081| -0.140|
|HEPG      | -0.081| -0.140|
|All Paths |-11.944|-12.085|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.081|  -11.944|  -0.140|  -12.085|    2.74%|   0:00:00.0| 2075.4M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
Analyzing useful skew in preCTS mode ...
The view delay ratios are: (my_analysis_view_setup 1) (my_analysis_view_hold 0.444056)
Analyzing useful skew in preCTS mode ...
|  -0.041|  -11.944|  -0.076|  -12.021|    2.74%|   0:00:01.0| 2100.9M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.042|  -11.944|  -0.076|  -12.021|    2.74%|   0:00:00.0| 2100.9M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.3 real=0:00:01.0 mem=2100.9M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.944|  -11.944| -11.944|  -12.021|    2.74%|   0:00:00.0| 2100.9M|my_analysis_view_setup|  default| walk                                 |
Analyzing useful skew in preCTS mode ...
| -11.944|  -11.944| -11.944|  -12.021|    2.74%|   0:00:00.0| 2100.9M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.1 real=0:00:00.0 mem=2100.9M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.4 real=0:00:01.0 mem=2100.9M) ***
OptDebug: End of Optimizer WNS Pass 2:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+

** GigaOpt Optimizer WNS Slack -11.944 TNS Slack -12.021 Density 2.74
*** Starting refinePlace (0:01:56 mem=2092.9M) ***
Total net bbox length = 2.380e+03 (1.466e+03 9.145e+02) (ext = 9.068e+02)

Starting Small incrNP...
Skipped incrNP (cpu=0:00:00.0, real=0:00:00.0, mem=2092.9M)
End of Small incrNP (cpu=0:00:00.0, real=0:00:00.0)
Move report: Detail placement moves 0 insts, mean move: 0.00 um, max move: 0.00 um 
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2092.9MB
Summary Report:
Instances move: 0 (out of 34 movable)
Instances flipped: 1
Mean displacement: 0.00 um
Max displacement: 0.00 um 
Total net bbox length = 2.380e+03 (1.466e+03 9.145e+02) (ext = 9.068e+02)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2092.9MB
*** Finished refinePlace (0:01:56 mem=2092.9M) ***
*** maximum move = 0.00 um ***
*** Finished re-routing un-routed nets (2092.9M) ***

*** Finish Physical Update (cpu=0:00:00.0 real=0:00:00.0 mem=2092.9M) ***
** GigaOpt Optimizer WNS Slack -11.944 TNS Slack -12.021 Density 2.74
OptDebug: End of Setup Fixing:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+


*** Finish pre-CTS Setup Fixing (cpu=0:00:01.6 real=0:00:02.0 mem=2092.9M) ***

*** WnsOpt #1 [finish] (place_opt_design #1) : cpu/real = 0:00:03.0/0:00:03.0 (1.0), totSession cpu/real = 0:01:56.4/0:10:55.8 (0.2), mem = 2009.8M
End: GigaOpt Optimization in WNS mode
*** Timing NOT met, worst failing slack is -11.944
*** Check timing (0:00:00.0)
Begin: GigaOpt Optimization in TNS mode
GigaOpt Checkpoint: Internal optTiming -allEndPoints -maxLocalDensity 0.95 -maxLocalDensityForHardenOpt 0.92 -numThreads 1 -preCTS -pgMode all -nativePathGroupFlow -wtns -nonLegalPlaceEcoBumpRecoveryInTNSOpt -NDROptEffortAuto -ipoTgtSlackCoef 1.5 -effTgtSlackCoef 1
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** TnsOpt #1 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:56.4/0:10:55.8 (0.2), mem = 2009.8M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Optimizer WNS Slack -11.944 TNS Slack -12.021 Density 2.74
OptDebug: Start of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.042|  -11.944|  -0.076|  -12.021|    2.74%|   0:00:00.0| 2069.1M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.042|  -11.944|  -0.076|  -12.021|    2.74%|   0:00:01.0| 2097.2M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.2 real=0:00:01.0 mem=2097.2M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.944|  -11.944| -11.944|  -12.021|    2.74%|   0:00:00.0| 2097.2M|my_analysis_view_setup|  default| walk                                 |
| -11.944|  -11.944| -11.944|  -12.021|    2.74%|   0:00:00.0| 2097.2M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2097.2M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.3 real=0:00:01.0 mem=2097.2M) ***
OptDebug: End of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+

*** Starting refinePlace (0:01:58 mem=2095.2M) ***
Total net bbox length = 2.376e+03 (1.466e+03 9.106e+02) (ext = 9.068e+02)

Starting Small incrNP...
Skipped incrNP (cpu=0:00:00.0, real=0:00:00.0, mem=2095.2M)
End of Small incrNP (cpu=0:00:00.0, real=0:00:00.0)
Move report: Detail placement moves 1 insts, mean move: 5.60 um, max move: 5.60 um 
	Max move on inst (g200__6783): (352.88, 404.40) --> (352.88, 398.80)
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2095.2MB
Summary Report:
Instances move: 1 (out of 34 movable)
Instances flipped: 0
Mean displacement: 5.60 um
Max displacement: 5.60 um (Instance: g200__6783) (352.88, 404.4) -> (352.88, 398.8)
	Length: 8 sites, height: 1 rows, site name: CoreSite, cell type: oaim22d1
Total net bbox length = 2.380e+03 (1.466e+03 9.140e+02) (ext = 9.068e+02)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2095.2MB
*** Finished refinePlace (0:01:58 mem=2095.2M) ***
*** maximum move = 5.60 um ***
*** Finished re-routing un-routed nets (2095.2M) ***

*** Finish Physical Update (cpu=0:00:00.1 real=0:00:00.0 mem=2095.2M) ***
** GigaOpt Optimizer WNS Slack -11.944 TNS Slack -12.021 Density 2.74
OptDebug: End of Setup Fixing:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+


*** Finish pre-CTS Setup Fixing (cpu=0:00:00.5 real=0:00:01.0 mem=2095.2M) ***

*** TnsOpt #1 [finish] (place_opt_design #1) : cpu/real = 0:00:01.8/0:00:01.8 (1.0), totSession cpu/real = 0:01:58.2/0:10:57.7 (0.2), mem = 2013.1M
End: GigaOpt Optimization in TNS mode
GigaOpt Checkpoint: Internal reclaim -numThreads 1 -customPhyUpdate -noGCompAndPhase -ensureOneAreaReclaim -force -svrReclaim -rtrShortNets -allowDegradingShortNetRemoval -preCTS -tgtSlackMult 2 -wtns -noRouteTypeResizePolish -noViewPrune -nativePathGroupFlow
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
Begin: Area Reclaim Optimization
*** AreaOpt #2 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:58.2/0:10:57.7 (0.2), mem = 2070.3M
Reclaim Optimization WNS Slack -11.944  TNS Slack -12.021 Density 2.74
+---------+---------+--------+--------+------------+--------+
| Density | Commits |  WNS   |  TNS   |    Real    |  Mem   |
+---------+---------+--------+--------+------------+--------+
|    2.74%|        -| -11.944| -12.021|   0:00:00.0| 2070.3M|
|    2.74%|        0| -11.944| -12.021|   0:00:00.0| 2070.3M|
|    2.74%|        0| -11.944| -12.021|   0:00:00.0| 2071.3M|
|    2.74%|        0| -11.944| -12.021|   0:00:00.0| 2071.3M|
|    2.74%|        0| -11.944| -12.021|   0:00:00.0| 2071.3M|
+---------+---------+--------+--------+------------+--------+
Reclaim Optimization End WNS Slack -11.944  TNS Slack -12.021 Density 2.74

Number of times islegalLocAvaiable called = 0 skipped = 0, called in commitmove = 0, skipped in commitmove = 0
End: Core Area Reclaim Optimization (cpu = 0:00:00.2) (real = 0:00:00.0) **
*** Starting refinePlace (0:01:58 mem=2071.3M) ***
Total net bbox length = 2.380e+03 (1.466e+03 9.140e+02) (ext = 9.068e+02)
Move report: Detail placement moves 0 insts, mean move: 0.00 um, max move: 0.00 um 
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2071.3MB
Summary Report:
Instances move: 0 (out of 34 movable)
Instances flipped: 0
Mean displacement: 0.00 um
Max displacement: 0.00 um 
Total net bbox length = 2.380e+03 (1.466e+03 9.140e+02) (ext = 9.068e+02)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2071.3MB
*** Finished refinePlace (0:01:58 mem=2071.3M) ***
*** maximum move = 0.00 um ***
*** Finished re-routing un-routed nets (2071.3M) ***

*** Finish Physical Update (cpu=0:00:00.0 real=0:00:00.0 mem=2071.3M) ***
*** AreaOpt #2 [finish] (place_opt_design #1) : cpu/real = 0:00:00.2/0:00:00.2 (1.0), totSession cpu/real = 0:01:58.4/0:10:57.9 (0.2), mem = 2071.3M
End: Area Reclaim Optimization (cpu=0:00:00, real=0:00:00, mem=2014.27M, totSessionCpu=0:01:58).
Begin: GigaOpt postEco DRV Optimization
GigaOpt Checkpoint: Internal optDRV -inPostEcoStage -smallScaleFixing -maxIter 3 -max_tran -max_cap -maxLocalDensity 0.98 -numThreads 1 -preRouteDontEndWithRefinePlaceIncrSteinerRouteDC -preCTS
*** DrvOpt #3 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:58.5/0:10:57.9 (0.2), mem = 2014.3M
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
|        max-tran       |        max-cap        |  max-fanout |  max-length |       setup       |        |        |        |       |          |         |
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
| nets | terms|  wViol  | nets | terms|  wViol  | nets | terms| nets | terms|   WNS   |   TNS   |  #Buf  |  #Inv  | #Resize|Density|   Real   |   Mem   |
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
|     3|     3|   -32.13|     3|     3|    -3.12|     3|     3|     0|     0|   -11.94|   -12.02|       0|       0|       0|  2.74%|          |         |
|     3|     3|   -32.13|     3|     3|    -3.12|     3|     3|     0|     0|   -11.94|   -12.02|       0|       0|       0|  2.74%| 0:00:00.0|  2071.5M|
+-------------------------------------------------------------------------------------------------------------------------------------------------------+


=======================================================================
                Reasons for remaining drv violations
=======================================================================
*info: Total 3 net(s) have violations which can't be fixed by DRV optimization.

MultiBuffering failure reasons
------------------------------------------------
*info:     3 net(s): Could not be fixed as the net is considered as IPO ignored by the process.


*** Finish DRV Fixing (cpu=0:00:00.0 real=0:00:00.0 mem=2071.5M) ***

*** DrvOpt #3 [finish] (place_opt_design #1) : cpu/real = 0:00:00.2/0:00:00.2 (1.0), totSession cpu/real = 0:01:58.7/0:10:58.1 (0.2), mem = 2014.4M
End: GigaOpt postEco DRV Optimization
GigaOpt: WNS changes after postEco optimization: -1.232 -> -1.232 (bump = 0.0)
GigaOpt: Skipping nonLegal postEco optimization
Design TNS changes after trial route: -12.021 -> -12.021
Begin: GigaOpt TNS non-legal recovery
GigaOpt Checkpoint: Internal optTiming -setupRecovery -newSetupRecovery -allEndPoints -maxLocalDensity 0.92 -numThreads 1 -nativePathGroupFlow  -NDROptEffortAuto  -ipoTgtSlackCoef 0 -effTgtSlackCoef 0 -tnsBumpRecoveryInTNS -integratedAreaOpt
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** TnsOpt #2 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:58.7/0:10:58.1 (0.2), mem = 2014.4M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Optimizer WNS Slack -11.944 TNS Slack -12.021 Density 2.74
OptDebug: Start of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.042|  -11.944|  -0.076|  -12.021|    2.74%|   0:00:00.0| 2073.7M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.042|  -11.944|  -0.076|  -12.021|    2.74%|   0:00:00.0| 2101.8M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.1 real=0:00:00.0 mem=2101.8M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.944|  -11.944| -11.944|  -12.021|    2.74%|   0:00:00.0| 2101.8M|my_analysis_view_setup|  default| walk                                 |
| -11.944|  -11.944| -11.944|  -12.021|    2.74%|   0:00:00.0| 2101.8M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2101.8M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.2 real=0:00:00.0 mem=2101.8M) ***
OptDebug: End of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+

OptDebug: End of Setup Fixing:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+


*** Finish pre-CTS Setup Fixing (cpu=0:00:00.3 real=0:00:01.0 mem=2101.8M) ***

*** TnsOpt #2 [finish] (place_opt_design #1) : cpu/real = 0:00:00.5/0:00:00.6 (1.0), totSession cpu/real = 0:01:59.2/0:10:58.7 (0.2), mem = 2016.7M
End: GigaOpt TNS non-legal recovery
Begin: GigaOpt Optimization in post-eco TNS mode
GigaOpt Checkpoint: Internal optTiming -postEco -postEcoLefSafe -maxLocalDensity 1.0 -numThreads 1  -allEndPoints -nativePathGroupFlow
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** TnsOpt #3 [begin] (place_opt_design #1) : totSession cpu/real = 0:01:59.2/0:10:58.7 (0.2), mem = 2016.7M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Optimizer WNS Slack -11.944 TNS Slack -12.021 Density 2.74
OptDebug: Start of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.042|  -11.944|  -0.076|  -12.021|    2.74%|   0:00:00.0| 2075.9M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.042|  -11.944|  -0.076|  -12.021|    2.74%|   0:00:00.0| 2075.9M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2075.9M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.944|  -11.944| -11.944|  -12.021|    2.74%|   0:00:00.0| 2075.9M|my_analysis_view_setup|  default| walk                                 |
| -11.944|  -11.944| -11.944|  -12.021|    2.74%|   0:00:00.0| 2075.9M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2075.9M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.0 real=0:00:00.0 mem=2075.9M) ***
OptDebug: End of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+

OptDebug: End of Setup Fixing:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.944|-11.944|
|reg2reg   | -0.042| -0.076|
|HEPG      | -0.042| -0.076|
|All Paths |-11.944|-12.021|
+----------+-------+-------+


*** Finish pre-CTS Setup Fixing (cpu=0:00:00.2 real=0:00:00.0 mem=2075.9M) ***

*** TnsOpt #3 [finish] (place_opt_design #1) : cpu/real = 0:00:00.4/0:00:00.4 (1.0), totSession cpu/real = 0:01:59.6/0:10:59.1 (0.2), mem = 2016.9M
End: GigaOpt Optimization in post-eco TNS mode
Register exp ratio and priority group on 0 nets on 50 nets : 

Active setup views:
 my_analysis_view_setup
  Dominating endpoints: 0
  Dominating TNS: -0.000

Extraction called for design 'top' of instances=102 and nets=54 using extraction engine 'preRoute' .
**WARN: (IMPEXT-3530):	The process node is not set. Use the command setDesignMode -process <process node> prior to extraction for maximum accuracy and optimal automatic threshold setting.
Type 'man IMPEXT-3530' for more detail.
PreRoute RC Extraction called for design top.
RC Extraction called in multi-corner(1) mode.
**WARN: (IMPEXT-6197):	The Cap table file is not specified. This will result in lower parasitic accuracy when using preRoute extraction or postRoute extraction with effort level 'low'. It is recommended to generate the Cap table file using the 'generateCapTbl' command and specify it before extraction using 'create_rc_corner/update_rc_corner -cap_table'.
Type 'man IMPEXT-6197' for more detail.
RCMode: PreRoute
      RC Corner Indexes            0   
Capacitance Scaling Factor   : 1.00000 
Resistance Scaling Factor    : 1.00000 
Clock Cap. Scaling Factor    : 1.00000 
Clock Res. Scaling Factor    : 1.00000 
Shrink Factor                : 1.00000
PreRoute extraction is honoring NDR/Shielding/ExtraSpace for clock nets.
Skipped RC grid update for preRoute extraction.
Initializing multi-corner resistance tables ...
PreRoute RC Extraction DONE (CPU Time: 0:00:00.0  Real Time: 0:00:00.0  MEM: 2045.496M)
Skewing Data Summary (End_of_FINAL)
--------------------------------------------------
 Total skewed count:1   (Analysis view: my_analysis_view_setup)
 Advancing count:1, Max:-39.5(ps) Min:-39.5(ps) Total:-39.5(ps)
 Delaying  count:0
--------------------------------------------------
Starting delay calculation for Setup views
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=2035.5)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq4) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb4) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 50
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=2019.54 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=2019.54 CPU=0:00:00.0 REAL=0:00:00.0)
*** Done Building Timing Graph (cpu=0:00:00.1 real=0:00:00.0 totSessionCpu=0:02:00 mem=2019.5M)
[NR-eGR] Num Prerouted Nets = 0  Num Prerouted Wires = 0
[NR-eGR] Read 42 nets ( ignored 0 )
[NR-eGR] There are 2 clock nets ( 0 with NDR ).
[NR-eGR] Layer group 1: route 42 net(s) in layer range [2, 4]
[NR-eGR] Early Global Route overflow of layer group 1: 0.00% H + 0.00% V. EstWL: 2.581600e+03um
[NR-eGR] Overflow after Early Global Route 0.00% H + 0.00% V
[NR-eGR] Finished Early Global Route kernel ( CPU: 0.03 sec, Real: 0.03 sec, Curr Mem: 2027.54 MB )
[hotspot] +------------+---------------+---------------+
[hotspot] |            |   max hotspot | total hotspot |
[hotspot] +------------+---------------+---------------+
[hotspot] | normalized |          0.00 |          0.00 |
[hotspot] +------------+---------------+---------------+
Local HotSpot Analysis: normalized max congestion hotspot area = 0.00, normalized total congestion hotspot area = 0.00 (area is in unit of 4 std-cell row bins)
[hotspot] Hotspot report including placement blocked areas
[hotspot] +------------+---------------+---------------+
[hotspot] |            |   max hotspot | total hotspot |
[hotspot] +------------+---------------+---------------+
[hotspot] | normalized |          0.00 |          0.00 |
[hotspot] +------------+---------------+---------------+
Local HotSpot Analysis (blockage included): normalized max congestion hotspot area = 0.00, normalized total congestion hotspot area = 0.00 (area is in unit of 4 std-cell row bins)
Reported timing to dir ./timingReports
**optDesign ... cpu = 0:00:16, real = 0:00:16, mem = 1503.5M, totSessionCpu=0:02:00 **

------------------------------------------------------------------
     optDesign Final Summary
------------------------------------------------------------------

Setup views included:
 my_analysis_view_setup 

+--------------------+---------+---------+---------+
|     Setup mode     |   all   | reg2reg | default |
+--------------------+---------+---------+---------+
|           WNS (ns):| -11.945 | -0.041  | -11.945 |
|           TNS (ns):| -12.020 | -0.076  | -11.945 |
|    Violating Paths:|    4    |    3    |    1    |
|          All Paths:|   39    |   18    |   22    |
+--------------------+---------+---------+---------+

+----------------+-------------------------------+------------------+
|                |              Real             |       Total      |
|    DRVs        +------------------+------------+------------------|
|                |  Nr nets(terms)  | Worst Vio  |  Nr nets(terms)  |
+----------------+------------------+------------+------------------+
|   max_cap      |      0 (0)       |   0.000    |      3 (3)       |
|   max_tran     |      0 (0)       |   0.000    |      3 (3)       |
|   max_fanout   |      0 (0)       |     0      |      3 (3)       |
|   max_length   |      0 (0)       |     0      |      0 (0)       |
+----------------+------------------+------------+------------------+

Density: 2.737%
Routing Overflow: 0.00% H and 0.00% V
------------------------------------------------------------------
**optDesign ... cpu = 0:00:16, real = 0:00:18, mem = 1504.5M, totSessionCpu=0:02:00 **
**WARN: (IMPOPT-3195):	Analysis mode has changed.
Type 'man IMPOPT-3195' for more detail.
*** Finished optDesign ***
 *** Writing scheduling file: 'scheduling_file.cts.6189' ***
Disable CTE adjustment.
#optDebug: fT-D <X 1 0 0 0>
**place_opt_design ... cpu = 0:00:17, real = 0:00:18, mem = 1956.0M **
*** Finished GigaPlace ***

*** Summary of all messages that are not suppressed in this session:
Severity  ID               Count  Summary                                  
WARNING   IMPMSMV-1810         9  Net %s, driver %s (cell %s) voltage %g d...
WARNING   IMPEXT-6197          3  The Cap table file is not specified. Thi...
WARNING   IMPEXT-3530          3  The process node is not set. Use the com...
WARNING   IMPSP-9025           1  No scan chain specified/traced.          
WARNING   IMPOPT-3195          2  Analysis mode has changed.               
*** Message Summary: 18 warning(s), 0 error(s)

*** place_opt_design #1 [finish] : cpu/real = 0:00:16.6/0:00:18.4 (0.9), totSession cpu/real = 0:02:00.1/0:11:01.0 (0.2), mem = 1956.0M
innovus 26> innovus 26> setCTSMode -engine ck
**WARN: (IMPCK-8086):	The command setCTSMode is obsolete and will be removed in the next release. This command still works in this release, but by the next release you must transition to the CCOpt-based CTS flow.
innovus 27> optDesign -postCTS
**optDesign ... cpu = 0:00:00, real = 0:00:00, mem = 1453.3M, totSessionCpu=0:02:02 **
*** optDesign #1 [begin] : totSession cpu/real = 0:02:01.6/0:11:20.3 (0.2), mem = 1956.1M
GigaOpt running with 1 threads.
*** InitOpt #1 [begin] (optDesign #1) : totSession cpu/real = 0:02:01.6/0:11:20.3 (0.2), mem = 1956.1M
**INFO: User settings:
setExtractRCMode -engine                   preRoute
setDelayCalMode -enable_high_fanout        true
setDelayCalMode -engine                    aae
setDelayCalMode -ignoreNetLoad             false
setDelayCalMode -socv_accuracy_mode        low
setOptMode -activeHoldViews                { my_analysis_view_hold }
setOptMode -activeSetupViews               { my_analysis_view_setup }
setOptMode -autoSetupViews                 { my_analysis_view_setup}
setOptMode -autoTDGRSetupViews             { my_analysis_view_setup}
setOptMode -drcMargin                      0
setOptMode -fixCap                         true
setOptMode -fixDrc                         true
setOptMode -fixFanoutLoad                  false
setOptMode -fixTran                        true
setOptMode -optimizeFF                     true
setOptMode -setupTargetSlack               0
setPlaceMode -place_design_floorplan_mode  false
setAnalysisMode -analysisType              bcwc
setAnalysisMode -checkType                 setup
setAnalysisMode -clkSrcPath                true
setAnalysisMode -clockPropagation          forcedIdeal
setAnalysisMode -usefulSkew                true

**INFO: setDesignMode -flowEffort standard -> setting 'setOptMode -allEndPoints true' for the duration of this command.
Need call spDPlaceInit before registerPrioInstLoc.
Turning off fast DC mode.
**optDesign ... cpu = 0:00:01, real = 0:00:01, mem = 1428.8M, totSessionCpu=0:02:03 **
*** optDesign -postCTS ***
DRC Margin: user margin 0.0; extra margin 0.2
Hold Target Slack: user slack 0
Setup Target Slack: user slack 0; extra slack 0.0
setUsefulSkewMode -ecoRoute false
**WARN: (IMPOPT-3195):	Analysis mode has changed.
Type 'man IMPOPT-3195' for more detail.
Multi-VT timing optimization disabled based on library information.
Start to check current routing status for nets...
All nets are already routed correctly.
End to check current routing status for nets (mem=1953.6M)
Starting delay calculation for Setup views
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=1957.33)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq4) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb4) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 50
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=1982.81 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=1982.81 CPU=0:00:00.0 REAL=0:00:00.0)
*** Done Building Timing Graph (cpu=0:00:00.1 real=0:00:00.0 totSessionCpu=0:02:03 mem=1982.8M)

------------------------------------------------------------------
             Initial Summary
------------------------------------------------------------------

Setup views included:
 my_analysis_view_setup 

+--------------------+---------+---------+---------+
|     Setup mode     |   all   | reg2reg | default |
+--------------------+---------+---------+---------+
|           WNS (ns):| -11.945 | -0.044  | -11.945 |
|           TNS (ns):| -12.025 | -0.081  | -11.945 |
|    Violating Paths:|    4    |    3    |    1    |
|          All Paths:|   39    |   18    |   22    |
+--------------------+---------+---------+---------+

+----------------+-------------------------------+------------------+
|                |              Real             |       Total      |
|    DRVs        +------------------+------------+------------------|
|                |  Nr nets(terms)  | Worst Vio  |  Nr nets(terms)  |
+----------------+------------------+------------+------------------+
|   max_cap      |      0 (0)       |   0.000    |      3 (3)       |
|   max_tran     |      0 (0)       |   0.000    |      3 (3)       |
|   max_fanout   |      0 (0)       |     0      |      3 (3)       |
|   max_length   |      0 (0)       |     0      |      0 (0)       |
+----------------+------------------+------------+------------------+

Density: 2.737%
Routing Overflow: 0.00% H and 0.00% V
------------------------------------------------------------------
**optDesign ... cpu = 0:00:01, real = 0:00:02, mem = 1451.8M, totSessionCpu=0:02:03 **
*** InitOpt #1 [finish] (optDesign #1) : cpu/real = 0:00:01.4/0:00:01.4 (1.0), totSession cpu/real = 0:02:03.0/0:11:21.8 (0.2), mem = 1949.1M
** INFO : this run is activating low effort ccoptDesign flow
OPTC: m1 20.0 20.0
#optDebug: fT-E <X 2 0 0 1>
-congRepairInPostCTS false                 # bool, default=false, private
GigaOpt Checkpoint: Internal congRefineRouteType -postCTS -congThreshold 0.001 -rescheduleForCongestion -resetVeryShortNets -resetShortNets -useSpineBased -rescheduleForAdherence -minSlack 101.2
Begin: GigaOpt Route Type Constraints Refinement
*** CongRefineRouteType #1 [begin] (optDesign #1) : totSession cpu/real = 0:02:03.1/0:11:21.8 (0.2), mem = 1951.1M
Updated routing constraints on 0 nets.
Bottom Preferred Layer:
    None
Via Pillar Rule:
    None
*** CongRefineRouteType #1 [finish] (optDesign #1) : cpu/real = 0:00:01.2/0:00:01.2 (1.0), totSession cpu/real = 0:02:04.3/0:11:23.0 (0.2), mem = 2053.9M
End: GigaOpt Route Type Constraints Refinement
*** Starting optimizing excluded clock nets MEM= 2053.9M) ***
*info: There are no clock nets marked defIn, clock nets will not be optimized.
*info: No excluded clock nets to be optimized.
*** Finished optimizing excluded clock nets (CPU Time= 0:00:00.0  MEM= 2053.9M) ***
*** Starting optimizing excluded clock nets MEM= 2053.9M) ***
*info: There are no clock nets marked defIn, clock nets will not be optimized.
*info: No excluded clock nets to be optimized.
*** Finished optimizing excluded clock nets (CPU Time= 0:00:00.0  MEM= 2053.9M) ***
Begin: GigaOpt high fanout net optimization
GigaOpt HFN: use maxLocalDensity 1.2
GigaOpt Checkpoint: Internal optDRV -useLevelizedBufferTreeOnly -auxMaxFanoutCountLimit 500 -largeScaleFixing -maxIter 1 -maxLocalDensity 1.2 -numThreads 1 -postCTS -preRouteDontEndWithRefinePlaceIncrSteinerRouteDC
*** DrvOpt #1 [begin] (optDesign #1) : totSession cpu/real = 0:02:04.3/0:11:23.0 (0.2), mem = 2053.9M
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** DrvOpt #1 [finish] (optDesign #1) : cpu/real = 0:00:00.2/0:00:00.2 (1.0), totSession cpu/real = 0:02:04.5/0:11:23.2 (0.2), mem = 2016.0M
GigaOpt HFN: restore maxLocalDensity to 0.98
End: GigaOpt high fanout net optimization
Begin: GigaOpt Global Optimization
*info: use new DP (enabled)
GigaOpt Checkpoint: Internal globalOpt -maxLocalDensity 1.2 -numThreads 1 -postCTS -preRouteDontEndWithRefinePlaceIncrSteinerRouteDC -enableHighLayerOpt -maxIter 50 -maxIterForLEPG 50
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** GlobalOpt #1 [begin] (optDesign #1) : totSession cpu/real = 0:02:04.6/0:11:23.3 (0.2), mem = 2016.0M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Global Opt WNS Slack -11.945  TNS Slack -12.025 
+--------+--------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   |  TNS   | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+--------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.945| -12.025|    2.74%|   0:00:00.0| 2073.2M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
| -11.945| -12.025|    2.74%|   0:00:00.0| 2100.3M|my_analysis_view_setup|  default| walk                                 |
+--------+--------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish post-CTS Global Setup Fixing (cpu=0:00:00.0 real=0:00:00.0 mem=2100.3M) ***

*** Finish post-CTS Setup Fixing (cpu=0:00:00.0 real=0:00:00.0 mem=2100.3M) ***
** GigaOpt Global Opt End WNS Slack -11.945  TNS Slack -12.025 
*** GlobalOpt #1 [finish] (optDesign #1) : cpu/real = 0:00:01.4/0:00:01.4 (1.0), totSession cpu/real = 0:02:06.0/0:11:24.8 (0.2), mem = 2022.2M
End: GigaOpt Global Optimization
*** Timing NOT met, worst failing slack is -11.945
*** Check timing (0:00:00.0)
GigaOpt Checkpoint: Internal reclaim -numThreads 1 -postCTS -doRemoveUselessTerm -tgtSlackMult 3 -routeType -noRouteTypeResizePolish -noViewPrune -weedwhack -nonLegal -nativePathGroupFlow
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
Begin: GigaOpt Optimization in WNS mode
GigaOpt Checkpoint: Internal optTiming -maxLocalDensity 1.0 -maxLocalDensityForHardenOpt 0.92 -numThreads 1 -postCTS -wtns -integratedAreaOpt -pgMode all -ipoTgtSlackCoef 1.5 -effTgtSlackCoef 1 -nativePathGroupFlow -NDROptEffortAuto -usefulSkew -nonLegalPlaceEcoBumpRecoveryInWNSOpt
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** WnsOpt #1 [begin] (optDesign #1) : totSession cpu/real = 0:02:06.1/0:11:24.8 (0.2), mem = 2020.2M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Optimizer WNS Slack -11.945 TNS Slack -12.025 Density 2.74
OptDebug: Start of Optimizer WNS Pass 0:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.945|-11.945|
|reg2reg   | -0.044| -0.081|
|HEPG      | -0.044| -0.081|
|All Paths |-11.945|-12.025|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.044|  -11.945|  -0.081|  -12.025|    2.74%|   0:00:00.0| 2081.5M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:01.0| 2117.6M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
**INFO: Starting Blocking QThread with 1 CPU
   ____________________________________________________________________
__/ message from Blocking QThread
*** QThread Job [begin] (WnsOpt #1 / optDesign #1) : mem = 0.6M
Starting delay calculation for Hold views
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
AAE_INFO: 1 threads acquired from CTE.
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=0)
*** Calculating scaling factor for my_min_library_set libraries using the default operating condition of each library.
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq4) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 3.6 for view my_analysis_view_hold.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb4) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 3.6 for view my_analysis_view_hold.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 3.6 for view my_analysis_view_hold.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 53
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=0 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=0 CPU=0:00:00.0 REAL=0:00:00.0)
*** Done Building Timing Graph (cpu=0:00:00.1 real=0:00:00.0 totSessionCpu=0:00:00.2 mem=0.0M)

------------------------------------------------------------------
     Design Initial Hold Timing
------------------------------------------------------------------

Hold views included:
 my_analysis_view_hold 

+--------------------+---------+---------+---------+
|     Hold mode      |   all   | reg2reg | default |
+--------------------+---------+---------+---------+
|           WNS (ns):| -0.091  |  0.190  | -0.091  |
|           TNS (ns):| -1.392  |  0.000  | -1.392  |
|    Violating Paths:|   17    |    0    |   17    |
|          All Paths:|   39    |   18    |   22    |
+--------------------+---------+---------+---------+

Density: 2.793%
Routing Overflow: 0.00% H and 0.00% V
------------------------------------------------------------------
Warning: No proper clock gate cell delay was found for clock standard delay computation.
*** QThread Job [finish] (WnsOpt #1 / optDesign #1) : cpu/real = 0:00:00.2/0:00:00.2 (1.0), mem = 0.0M
_______________________________________________________________________
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:01.0| 2117.6M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:01.0| 2117.6M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.4 real=0:00:01.0 mem=2117.6M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.945|  -11.945| -11.945|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  default| walk                                 |
| -11.945|  -11.945| -11.945|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2117.6M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.4 real=0:00:01.0 mem=2117.6M) ***
OptDebug: End of Optimizer WNS Pass 0:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.945|-11.945|
|reg2reg   | -0.032| -0.085|
|HEPG      | -0.032| -0.085|
|All Paths |-11.945|-12.030|
+----------+-------+-------+

** GigaOpt Optimizer WNS Slack -11.945 TNS Slack -12.030 Density 2.79
*** Starting refinePlace (0:02:08 mem=2117.6M) ***
Total net bbox length = 2.373e+03 (1.454e+03 9.190e+02) (ext = 9.068e+02)

Starting Small incrNP...
Density distribution unevenness ratio = 68.585%
Skipped incrNP (cpu=0:00:00.0, real=0:00:00.0, mem=2117.6M)
End of Small incrNP (cpu=0:00:00.0, real=0:00:00.0)
Move report: Detail placement moves 7 insts, mean move: 2.00 um, max move: 2.80 um 
	Max move on inst (granted_reg): (352.32, 393.20) --> (355.12, 393.20)
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2117.6MB
Summary Report:
Instances move: 7 (out of 37 movable)
Instances flipped: 0
Mean displacement: 2.00 um
Max displacement: 2.80 um (Instance: granted_reg) (352.32, 393.2) -> (355.12, 393.2)
	Length: 37 sites, height: 1 rows, site name: CoreSite, cell type: decrq4
Total net bbox length = 2.403e+03 (1.484e+03 9.190e+02) (ext = 9.068e+02)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2117.6MB
*** Finished refinePlace (0:02:08 mem=2117.6M) ***
*** maximum move = 2.80 um ***
*** Finished re-routing un-routed nets (2117.6M) ***

*** Finish Physical Update (cpu=0:00:00.1 real=0:00:00.0 mem=2117.6M) ***
** GigaOpt Optimizer WNS Slack -11.945 TNS Slack -12.030 Density 2.79
OptDebug: Start of Optimizer WNS Pass 1:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.945|-11.945|
|reg2reg   | -0.032| -0.085|
|HEPG      | -0.032| -0.085|
|All Paths |-11.945|-12.030|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.2 real=0:00:00.0 mem=2117.6M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.945|  -11.945| -11.945|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  default| walk                                 |
| -11.945|  -11.945| -11.945|  -12.030|    2.79%|   0:00:00.0| 2117.6M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2117.6M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.2 real=0:00:00.0 mem=2117.6M) ***
OptDebug: End of Optimizer WNS Pass 1:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.945|-11.945|
|reg2reg   | -0.032| -0.085|
|HEPG      | -0.032| -0.085|
|All Paths |-11.945|-12.030|
+----------+-------+-------+

** GigaOpt Optimizer WNS Slack -11.945 TNS Slack -12.030 Density 2.79
*** Starting refinePlace (0:02:08 mem=2117.6M) ***
Total net bbox length = 2.403e+03 (1.484e+03 9.190e+02) (ext = 9.068e+02)

Starting Small incrNP...
Density distribution unevenness ratio = 68.585%
Skipped incrNP (cpu=0:00:00.0, real=0:00:00.0, mem=2117.6M)
End of Small incrNP (cpu=0:00:00.0, real=0:00:00.0)
Move report: Detail placement moves 0 insts, mean move: 0.00 um, max move: 0.00 um 
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2117.6MB
Summary Report:
Instances move: 0 (out of 37 movable)
Instances flipped: 0
Mean displacement: 0.00 um
Max displacement: 0.00 um 
Total net bbox length = 2.403e+03 (1.484e+03 9.190e+02) (ext = 9.068e+02)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2117.6MB
*** Finished refinePlace (0:02:08 mem=2117.6M) ***
*** maximum move = 0.00 um ***
*** Finished re-routing un-routed nets (2117.6M) ***

*** Finish Physical Update (cpu=0:00:00.0 real=0:00:01.0 mem=2117.6M) ***
** GigaOpt Optimizer WNS Slack -11.945 TNS Slack -12.030 Density 2.79
OptDebug: End of Setup Fixing:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.945|-11.945|
|reg2reg   | -0.032| -0.085|
|HEPG      | -0.032| -0.085|
|All Paths |-11.945|-12.030|
+----------+-------+-------+


*** Finish post-CTS Setup Fixing (cpu=0:00:01.0 real=0:00:02.0 mem=2117.6M) ***

*** WnsOpt #1 [finish] (optDesign #1) : cpu/real = 0:00:02.4/0:00:02.7 (0.9), totSession cpu/real = 0:02:08.5/0:11:27.5 (0.2), mem = 2035.5M
End: GigaOpt Optimization in WNS mode
Begin: GigaOpt Optimization in TNS mode
GigaOpt Checkpoint: Internal optTiming -allEndPoints -maxLocalDensity 0.95 -maxLocalDensityForHardenOpt 0.92 -numThreads 1 -postCTS -pgMode all -nativePathGroupFlow -wtns -nonLegalPlaceEcoBumpRecoveryInTNSOpt -NDROptEffortAuto -ipoTgtSlackCoef 1.5 -effTgtSlackCoef 1
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** TnsOpt #1 [begin] (optDesign #1) : totSession cpu/real = 0:02:08.5/0:11:27.5 (0.2), mem = 2035.5M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Optimizer WNS Slack -11.945 TNS Slack -12.030 Density 2.79
OptDebug: Start of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.945|-11.945|
|reg2reg   | -0.032| -0.085|
|HEPG      | -0.032| -0.085|
|All Paths |-11.945|-12.030|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:00.0| 2094.7M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.032|  -11.945|  -0.085|  -12.030|    2.79%|   0:00:00.0| 2119.8M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.2 real=0:00:00.0 mem=2119.8M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.945|  -11.945| -11.945|  -12.030|    2.79%|   0:00:00.0| 2119.8M|my_analysis_view_setup|  default| walk                                 |
| -11.945|  -11.945| -11.945|  -12.030|    2.79%|   0:00:00.0| 2119.8M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2119.8M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.2 real=0:00:00.0 mem=2119.8M) ***
OptDebug: End of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.945|-11.945|
|reg2reg   | -0.032| -0.085|
|HEPG      | -0.032| -0.085|
|All Paths |-11.945|-12.030|
+----------+-------+-------+

OptDebug: End of Setup Fixing:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.945|-11.945|
|reg2reg   | -0.032| -0.085|
|HEPG      | -0.032| -0.085|
|All Paths |-11.945|-12.030|
+----------+-------+-------+


*** Finish post-CTS Setup Fixing (cpu=0:00:00.4 real=0:00:00.0 mem=2119.8M) ***

*** TnsOpt #1 [finish] (optDesign #1) : cpu/real = 0:00:01.7/0:00:01.6 (1.0), totSession cpu/real = 0:02:10.2/0:11:29.2 (0.2), mem = 2037.8M
End: GigaOpt Optimization in TNS mode
GigaOpt Checkpoint: Internal reclaim -numThreads 1 -customPhyUpdate -noGCompAndPhase -force -svrReclaim -rtrShortNets -allowDegradingShortNetRemoval -postCTS -tgtSlackMult 2 -wtns -noRouteTypeResizePolish -noViewPrune -nativePathGroupFlow
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
Begin: Area Reclaim Optimization
*** AreaOpt #1 [begin] (optDesign #1) : totSession cpu/real = 0:02:10.2/0:11:29.2 (0.2), mem = 2095.0M
Usable buffer cells for single buffer setup transform:
buffd1 bufbd1 buffd3 bufbd2 buffd2 bufbd3 bufbd4 buffd4 buffd7 buffda bufbd7 bufbda bufbdf 
Number of usable buffer cells above: 13
Reclaim Optimization WNS Slack -11.945  TNS Slack -12.030 Density 2.79
+---------+---------+--------+--------+------------+--------+
| Density | Commits |  WNS   |  TNS   |    Real    |  Mem   |
+---------+---------+--------+--------+------------+--------+
|    2.79%|        -| -11.945| -12.030|   0:00:00.0| 2095.0M|
|    2.79%|        0| -11.945| -12.030|   0:00:00.0| 2096.5M|
|    2.79%|        0| -11.945| -12.030|   0:00:00.0| 2096.5M|
|    2.79%|        0| -11.945| -12.030|   0:00:00.0| 2096.5M|
|    2.79%|        0| -11.945| -12.030|   0:00:00.0| 2096.5M|
|    2.79%|        0| -11.945| -12.030|   0:00:00.0| 2096.5M|
+---------+---------+--------+--------+------------+--------+
Reclaim Optimization End WNS Slack -11.945  TNS Slack -12.030 Density 2.79

Number of times islegalLocAvaiable called = 0 skipped = 0, called in commitmove = 0, skipped in commitmove = 0
End: Core Area Reclaim Optimization (cpu = 0:00:00.2) (real = 0:00:00.0) **
*** Starting refinePlace (0:02:10 mem=2096.5M) ***
Total net bbox length = 2.403e+03 (1.484e+03 9.190e+02) (ext = 9.068e+02)
Move report: Detail placement moves 0 insts, mean move: 0.00 um, max move: 0.00 um 
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2096.5MB
Summary Report:
Instances move: 0 (out of 37 movable)
Instances flipped: 0
Mean displacement: 0.00 um
Max displacement: 0.00 um 
Total net bbox length = 2.403e+03 (1.484e+03 9.190e+02) (ext = 9.068e+02)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2096.5MB
*** Finished refinePlace (0:02:10 mem=2096.5M) ***
*** maximum move = 0.00 um ***
*** Finished re-routing un-routed nets (2096.5M) ***

*** Finish Physical Update (cpu=0:00:00.0 real=0:00:00.0 mem=2096.5M) ***
*** AreaOpt #1 [finish] (optDesign #1) : cpu/real = 0:00:00.2/0:00:00.2 (1.0), totSession cpu/real = 0:02:10.4/0:11:29.4 (0.2), mem = 2096.5M
End: Area Reclaim Optimization (cpu=0:00:00, real=0:00:00, mem=2039.41M, totSessionCpu=0:02:10).
postCtsLateCongRepair #1 0
postCtsLateCongRepair #1 0
postCtsLateCongRepair #1 0
postCtsLateCongRepair #1 0
Starting local wire reclaim
*** ThreeLayerMode is automatically turned on for small designs with less than 4 layers.
ThreeLayerMode is on. Timing-driven placement option disabled.
*** Starting refinePlace (0:02:10 mem=2039.4M) ***
*** Finished SKP initialization (cpu=0:00:00.0, real=0:00:00.0)***
Timing cost in AAE based: 1117.3224547855998026
Move report: Detail placement moves 19 insts, mean move: 9.11 um, max move: 29.12 um 
	Max move on inst (g217__1705): (343.92, 393.20) --> (356.24, 376.40)
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2037.4MB
Summary Report:
Instances move: 19 (out of 37 movable)
Instances flipped: 0
Mean displacement: 9.11 um
Max displacement: 29.12 um (Instance: g217__1705) (343.92, 393.2) -> (356.24, 376.4)
	Length: 11 sites, height: 1 rows, site name: CoreSite, cell type: nd04d2
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2037.4MB
*** Finished refinePlace (0:02:10 mem=2037.4M) ***
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=2017.89)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq4) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb4) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 53
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=2045.84 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=2045.84 CPU=0:00:00.0 REAL=0:00:00.0)
eGR doReRoute: optGuide
[NR-eGR] Num Prerouted Nets = 0  Num Prerouted Wires = 0
[NR-eGR] Read 45 nets ( ignored 0 )
[NR-eGR] There are 2 clock nets ( 0 with NDR ).
[NR-eGR] Layer group 1: route 45 net(s) in layer range [2, 4]
[NR-eGR] Early Global Route overflow of layer group 1: 0.04% H + 0.00% V. EstWL: 2.508800e+03um
[NR-eGR] Overflow after Early Global Route 0.00% H + 0.00% V
[NR-eGR]                Length (um)  Vias 
[NR-eGR] ---------------------------------
[NR-eGR]  M1     (1H)             0   141 
[NR-eGR]  M2     (2V)           953   205 
[NR-eGR]  M3     (3H)          1576     6 
[NR-eGR]  TOP_M  (4V)             3     0 
[NR-eGR] ---------------------------------
[NR-eGR]         Total         2531   352 
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Total half perimeter of net bounding box: 2319um
[NR-eGR] Total length: 2531um, number of vias: 352
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Total eGR-routed clock nets wire length: 515um, number of vias: 50
[NR-eGR] --------------------------------------------------------------------------
[NR-eGR] Finished Early Global Route kernel ( CPU: 0.06 sec, Real: 0.06 sec, Curr Mem: 1996.32 MB )
Extraction called for design 'top' of instances=105 and nets=57 using extraction engine 'preRoute' .
**WARN: (IMPEXT-3530):	The process node is not set. Use the command setDesignMode -process <process node> prior to extraction for maximum accuracy and optimal automatic threshold setting.
Type 'man IMPEXT-3530' for more detail.
PreRoute RC Extraction called for design top.
RC Extraction called in multi-corner(1) mode.
**WARN: (IMPEXT-6197):	The Cap table file is not specified. This will result in lower parasitic accuracy when using preRoute extraction or postRoute extraction with effort level 'low'. It is recommended to generate the Cap table file using the 'generateCapTbl' command and specify it before extraction using 'create_rc_corner/update_rc_corner -cap_table'.
Type 'man IMPEXT-6197' for more detail.
RCMode: PreRoute
      RC Corner Indexes            0   
Capacitance Scaling Factor   : 1.00000 
Resistance Scaling Factor    : 1.00000 
Clock Cap. Scaling Factor    : 1.00000 
Clock Res. Scaling Factor    : 1.00000 
Shrink Factor                : 1.00000
PreRoute extraction is honoring NDR/Shielding/ExtraSpace for clock nets.
Updating RC grid for preRoute extraction ...
Initializing multi-corner resistance tables ...
PreRoute RC Extraction DONE (CPU Time: 0:00:00.0  Real Time: 0:00:00.0  MEM: 1996.324M)
Compute RC Scale Done ...
[hotspot] +------------+---------------+---------------+
[hotspot] |            |   max hotspot | total hotspot |
[hotspot] +------------+---------------+---------------+
[hotspot] | normalized |          0.00 |          0.00 |
[hotspot] +------------+---------------+---------------+
Local HotSpot Analysis: normalized max congestion hotspot area = 0.00, normalized total congestion hotspot area = 0.00 (area is in unit of 4 std-cell row bins)
GigaOpt Checkpoint: Internal congRefineRouteType -postCTS -resetVeryShortNets -rescheduleForAdherence  
Begin: GigaOpt Route Type Constraints Refinement
*** CongRefineRouteType #2 [begin] (optDesign #1) : totSession cpu/real = 0:02:10.7/0:11:29.7 (0.2), mem = 2015.4M
Updated routing constraints on 0 nets.
Bottom Preferred Layer:
    None
Via Pillar Rule:
    None
*** CongRefineRouteType #2 [finish] (optDesign #1) : cpu/real = 0:00:00.0/0:00:00.0 (0.0), totSession cpu/real = 0:02:10.7/0:11:29.8 (0.2), mem = 2015.4M
End: GigaOpt Route Type Constraints Refinement
skip EGR on cluster skew clock nets.
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=2013.4)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq4) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb4) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 53
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=2042.53 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=2042.53 CPU=0:00:00.0 REAL=0:00:00.0)
Begin: GigaOpt postEco DRV Optimization
GigaOpt Checkpoint: Internal optDRV -inPostEcoStage -smallScaleFixing -maxIter 3 -max_tran -max_cap -maxLocalDensity 0.98 -numThreads 1 -preRouteDontEndWithRefinePlaceIncrSteinerRouteDC -postCTS
*** DrvOpt #2 [begin] (optDesign #1) : totSession cpu/real = 0:02:10.8/0:11:29.9 (0.2), mem = 2042.5M
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
|        max-tran       |        max-cap        |  max-fanout |  max-length |       setup       |        |        |        |       |          |         |
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
| nets | terms|  wViol  | nets | terms|  wViol  | nets | terms| nets | terms|   WNS   |   TNS   |  #Buf  |  #Inv  | #Resize|Density|   Real   |   Mem   |
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
|     3|     3|   -32.13|     3|     3|    -3.12|     3|     3|     0|     0|   -11.99|   -12.19|       0|       0|       0|  2.79%|          |         |
|     3|     3|   -32.13|     3|     3|    -3.12|     3|     3|     0|     0|   -11.99|   -12.19|       0|       0|       0|  2.79%| 0:00:00.0|  2092.9M|
+-------------------------------------------------------------------------------------------------------------------------------------------------------+


=======================================================================
                Reasons for remaining drv violations
=======================================================================
*info: Total 3 net(s) have violations which can't be fixed by DRV optimization.

MultiBuffering failure reasons
------------------------------------------------
*info:     3 net(s): Could not be fixed as the net is considered as IPO ignored by the process.


*** Finish DRV Fixing (cpu=0:00:00.0 real=0:00:00.0 mem=2092.9M) ***

*** DrvOpt #2 [finish] (optDesign #1) : cpu/real = 0:00:00.2/0:00:00.2 (1.0), totSession cpu/real = 0:02:11.0/0:11:30.1 (0.2), mem = 2031.8M
End: GigaOpt postEco DRV Optimization
GigaOpt: WNS changes after postEco optimization: -1.223 -> -1.279 (bump = 0.056)
GigaOpt: Skipping nonLegal postEco optimization
Design TNS changes after trial route: -12.029 -> -12.191
Begin: GigaOpt TNS non-legal recovery
GigaOpt Checkpoint: Internal optTiming -setupRecovery -newSetupRecovery -allEndPoints -maxLocalDensity 0.92 -numThreads 1 -nativePathGroupFlow  -NDROptEffortAuto  -ipoTgtSlackCoef 0 -effTgtSlackCoef 0 -tnsBumpRecoveryInTNS -integratedAreaOpt
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** TnsOpt #2 [begin] (optDesign #1) : totSession cpu/real = 0:02:11.0/0:11:30.1 (0.2), mem = 2031.8M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Optimizer WNS Slack -11.991 TNS Slack -12.191 Density 2.79
OptDebug: Start of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.991|-11.991|
|reg2reg   | -0.089| -0.199|
|HEPG      | -0.089| -0.199|
|All Paths |-11.991|-12.191|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.089|  -11.991|  -0.199|  -12.191|    2.79%|   0:00:00.0| 2091.0M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.066|  -11.991|  -0.133|  -12.124|    2.74%|   0:00:01.0| 2127.1M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.4 real=0:00:01.0 mem=2127.1M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.991|  -11.991| -11.991|  -12.124|    2.74%|   0:00:00.0| 2127.1M|my_analysis_view_setup|  default| walk                                 |
| -11.991|  -11.991| -11.991|  -12.124|    2.74%|   0:00:00.0| 2127.1M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2127.1M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.4 real=0:00:01.0 mem=2127.1M) ***
OptDebug: End of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.991|-11.991|
|reg2reg   | -0.066| -0.133|
|HEPG      | -0.066| -0.133|
|All Paths |-11.991|-12.124|
+----------+-------+-------+

*** Starting refinePlace (0:02:12 mem=2127.1M) ***
Total net bbox length = 2.312e+03 (1.445e+03 8.675e+02) (ext = 9.387e+02)

Starting Small incrNP...
Density distribution unevenness ratio = 68.399%
Skipped incrNP (cpu=0:00:00.0, real=0:00:00.0, mem=2127.1M)
End of Small incrNP (cpu=0:00:00.0, real=0:00:00.0)
Move report: Detail placement moves 4 insts, mean move: 1.40 um, max move: 3.92 um 
	Max move on inst (FE_OCPC2_n_8): (357.36, 393.20) --> (353.44, 393.20)
	Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2127.1MB
Summary Report:
Instances move: 4 (out of 36 movable)
Instances flipped: 0
Mean displacement: 1.40 um
Max displacement: 3.92 um (Instance: FE_OCPC2_n_8) (357.36, 393.2) -> (353.44, 393.2)
	Length: 4 sites, height: 1 rows, site name: CoreSite, cell type: inv0d2
Total net bbox length = 2.313e+03 (1.445e+03 8.675e+02) (ext = 9.392e+02)
Runtime: CPU: 0:00:00.0 REAL: 0:00:00.0 MEM: 2127.1MB
*** Finished refinePlace (0:02:12 mem=2127.1M) ***
*** maximum move = 3.92 um ***
*** Finished re-routing un-routed nets (2127.1M) ***

*** Finish Physical Update (cpu=0:00:00.0 real=0:00:00.0 mem=2127.1M) ***
** GigaOpt Optimizer WNS Slack -11.991 TNS Slack -12.124 Density 2.74
OptDebug: End of Setup Fixing:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.991|-11.991|
|reg2reg   | -0.066| -0.133|
|HEPG      | -0.066| -0.133|
|All Paths |-11.991|-12.124|
+----------+-------+-------+


*** Finish post-CTS Setup Fixing (cpu=0:00:00.6 real=0:00:01.0 mem=2127.1M) ***

*** TnsOpt #2 [finish] (optDesign #1) : cpu/real = 0:00:00.8/0:00:00.8 (1.0), totSession cpu/real = 0:02:11.9/0:11:30.9 (0.2), mem = 2043.1M
End: GigaOpt TNS non-legal recovery
Begin: GigaOpt Optimization in post-eco TNS mode
GigaOpt Checkpoint: Internal optTiming -postEco -postEcoLefSafe -maxLocalDensity 1.0 -numThreads 1  -allEndPoints -nativePathGroupFlow
Info: 8 io nets excluded
Info: 2 clock nets excluded from IPO operation.
*** TnsOpt #3 [begin] (optDesign #1) : totSession cpu/real = 0:02:11.9/0:11:30.9 (0.2), mem = 2043.1M
*info: 8 io nets excluded
*info: 2 clock nets excluded
** GigaOpt Optimizer WNS Slack -11.991 TNS Slack -12.124 Density 2.74
OptDebug: Start of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.991|-11.991|
|reg2reg   | -0.066| -0.133|
|HEPG      | -0.066| -0.133|
|All Paths |-11.991|-12.124|
+----------+-------+-------+

Active Path Group: reg2reg  
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  -0.066|  -11.991|  -0.133|  -12.124|    2.74%|   0:00:00.0| 2102.3M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
|  -0.066|  -11.991|  -0.133|  -12.124|    2.74%|   0:00:00.0| 2102.3M|my_analysis_view_setup|  reg2reg| granted_reg/ENN                      |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2102.3M) ***
Active Path Group: default 
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
|  WNS   | All WNS |  TNS   | All TNS | Density |    Real    |  Mem   |      Worst View      |Pathgroup|              End Point               |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+
| -11.991|  -11.991| -11.991|  -12.124|    2.74%|   0:00:00.0| 2102.3M|my_analysis_view_setup|  default| walk                                 |
| -11.991|  -11.991| -11.991|  -12.124|    2.74%|   0:00:00.0| 2102.3M|my_analysis_view_setup|  default| walk                                 |
+--------+---------+--------+---------+---------+------------+--------+----------------------+---------+--------------------------------------+

*** Finish Core Optimize Step (cpu=0:00:00.0 real=0:00:00.0 mem=2102.3M) ***

*** Finished Optimize Step Cumulative (cpu=0:00:00.0 real=0:00:00.0 mem=2102.3M) ***
OptDebug: End of Optimizer TNS Pass:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.991|-11.991|
|reg2reg   | -0.066| -0.133|
|HEPG      | -0.066| -0.133|
|All Paths |-11.991|-12.124|
+----------+-------+-------+

OptDebug: End of Setup Fixing:
+----------+-------+-------+
|Path Group|    WNS|    TNS|
+----------+-------+-------+
|default   |-11.991|-11.991|
|reg2reg   | -0.066| -0.133|
|HEPG      | -0.066| -0.133|
|All Paths |-11.991|-12.124|
+----------+-------+-------+


*** Finish post-CTS Setup Fixing (cpu=0:00:00.2 real=0:00:00.0 mem=2102.3M) ***

*** TnsOpt #3 [finish] (optDesign #1) : cpu/real = 0:00:00.4/0:00:00.4 (1.0), totSession cpu/real = 0:02:12.3/0:11:31.3 (0.2), mem = 2043.2M
End: GigaOpt Optimization in post-eco TNS mode
#optDebug: fT-D <X 1 0 0 0>
Register exp ratio and priority group on 0 nets on 52 nets : 

Active setup views:
 my_analysis_view_setup
  Dominating endpoints: 0
  Dominating TNS: -0.000

Extraction called for design 'top' of instances=104 and nets=56 using extraction engine 'preRoute' .
**WARN: (IMPEXT-3530):	The process node is not set. Use the command setDesignMode -process <process node> prior to extraction for maximum accuracy and optimal automatic threshold setting.
Type 'man IMPEXT-3530' for more detail.
PreRoute RC Extraction called for design top.
RC Extraction called in multi-corner(1) mode.
**WARN: (IMPEXT-6197):	The Cap table file is not specified. This will result in lower parasitic accuracy when using preRoute extraction or postRoute extraction with effort level 'low'. It is recommended to generate the Cap table file using the 'generateCapTbl' command and specify it before extraction using 'create_rc_corner/update_rc_corner -cap_table'.
Type 'man IMPEXT-6197' for more detail.
RCMode: PreRoute
      RC Corner Indexes            0   
Capacitance Scaling Factor   : 1.00000 
Resistance Scaling Factor    : 1.00000 
Clock Cap. Scaling Factor    : 1.00000 
Clock Res. Scaling Factor    : 1.00000 
Shrink Factor                : 1.00000
PreRoute extraction is honoring NDR/Shielding/ExtraSpace for clock nets.
Skipped RC grid update for preRoute extraction.
Initializing multi-corner resistance tables ...
PreRoute RC Extraction DONE (CPU Time: 0:00:00.0  Real Time: 0:00:00.0  MEM: 2071.859M)
Starting delay calculation for Setup views
AAE_INFO: opIsDesignInPostRouteState() is 0
#################################################################################
# Design Stage: PreRoute
# Design Name: top
# Design Mode: 90nm
# Analysis Mode: MMMC Non-OCV 
# Parasitics Mode: No SPEF/RCDB 
# Signoff Settings: SI Off 
#################################################################################
Calculate delays in BcWc mode...
Start delay calculation (fullDC) (1 T). (MEM=2061.86)
**WARN: (IMPMSMV-1810):	Net traffic_light[1], driver U_TRAFFIC_traffic_light_reg[1]/Q (cell dfcrq4) voltage 1.62 does not match receiver t_light1/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net traffic_light[0], driver U_TRAFFIC_traffic_light_reg[0]/Q (cell dfcrb4) voltage 1.62 does not match receiver t_light0/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
**WARN: (IMPMSMV-1810):	Net walk, driver U_PED_walk_reg/Q (cell dfcrq1) voltage 1.62 does not match receiver p_walk/PAD (cell pc3d01) voltage 2.7 for view my_analysis_view_setup.
Type 'man IMPMSMV-1810' for more detail.
Total number of fetched objects 52
AAE_INFO: Total number of nets for which stage creation was skipped for all views 0
End delay calculation. (MEM=2047.64 CPU=0:00:00.0 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=2047.64 CPU=0:00:00.0 REAL=0:00:00.0)
*** Done Building Timing Graph (cpu=0:00:00.1 real=0:00:00.0 totSessionCpu=0:02:12 mem=2047.6M)
[NR-eGR] Num Prerouted Nets = 0  Num Prerouted Wires = 0
[NR-eGR] Read 44 nets ( ignored 0 )
[NR-eGR] There are 2 clock nets ( 0 with NDR ).
[NR-eGR] Layer group 1: route 44 net(s) in layer range [2, 4]
[NR-eGR] Early Global Route overflow of layer group 1: 0.04% H + 0.00% V. EstWL: 2.486400e+03um
[NR-eGR] Overflow after Early Global Route 0.00% H + 0.00% V
[NR-eGR] Finished Early Global Route kernel ( CPU: 0.03 sec, Real: 0.03 sec, Curr Mem: 2055.64 MB )
[hotspot] +------------+---------------+---------------+
[hotspot] |            |   max hotspot | total hotspot |
[hotspot] +------------+---------------+---------------+
[hotspot] | normalized |          0.00 |          0.00 |
[hotspot] +------------+---------------+---------------+
Local HotSpot Analysis: normalized max congestion hotspot area = 0.00, normalized total congestion hotspot area = 0.00 (area is in unit of 4 std-cell row bins)
[hotspot] Hotspot report including placement blocked areas
[hotspot] +------------+---------------+---------------+
[hotspot] |            |   max hotspot | total hotspot |
[hotspot] +------------+---------------+---------------+
[hotspot] | normalized |          0.00 |          0.00 |
[hotspot] +------------+---------------+---------------+
Local HotSpot Analysis (blockage included): normalized max congestion hotspot area = 0.00, normalized total congestion hotspot area = 0.00 (area is in unit of 4 std-cell row bins)
Reported timing to dir ./timingReports
**optDesign ... cpu = 0:00:11, real = 0:00:12, mem = 1506.9M, totSessionCpu=0:02:12 **

------------------------------------------------------------------
     optDesign Final Summary
------------------------------------------------------------------

Setup views included:
 my_analysis_view_setup 

+--------------------+---------+---------+---------+
|     Setup mode     |   all   | reg2reg | default |
+--------------------+---------+---------+---------+
|           WNS (ns):| -11.991 | -0.066  | -11.991 |
|           TNS (ns):| -12.124 | -0.133  | -11.991 |
|    Violating Paths:|    4    |    3    |    1    |
|          All Paths:|   39    |   18    |   22    |
+--------------------+---------+---------+---------+

+----------------+-------------------------------+------------------+
|                |              Real             |       Total      |
|    DRVs        +------------------+------------+------------------|
|                |  Nr nets(terms)  | Worst Vio  |  Nr nets(terms)  |
+----------------+------------------+------------+------------------+
|   max_cap      |      0 (0)       |   0.000    |      3 (3)       |
|   max_tran     |      0 (0)       |   0.000    |      3 (3)       |
|   max_fanout   |      0 (0)       |     0      |      3 (3)       |
|   max_length   |      0 (0)       |     0      |      0 (0)       |
+----------------+------------------+------------+------------------+

Density: 2.737%
Routing Overflow: 0.00% H and 0.00% V
------------------------------------------------------------------
**optDesign ... cpu = 0:00:11, real = 0:00:13, mem = 1507.7M, totSessionCpu=0:02:13 **
**WARN: (IMPOPT-3195):	Analysis mode has changed.
Type 'man IMPOPT-3195' for more detail.
*** Finished optDesign ***
Info: Destroy the CCOpt slew target map.
*** optDesign #1 [finish] : cpu/real = 0:00:11.0/0:00:12.7 (0.9), totSession cpu/real = 0:02:12.7/0:11:33.1 (0.2), mem = 2029.1M
0
innovus 28> innovus 28> saveDesign top_cts
#% Begin save design ... (date=10/09 14:02:18, mem=1451.4M)
% Begin Save ccopt configuration ... (date=10/09 14:02:18, mem=1451.4M)
% End Save ccopt configuration ... (date=10/09 14:02:18, total cpu=0:00:00.0, real=0:00:00.0, peak res=1452.0M, current mem=1452.0M)
% Begin Save netlist data ... (date=10/09 14:02:18, mem=1452.0M)
Writing Binary DB to top_cts.dat/top.v.bin in single-threaded mode...
% End Save netlist data ... (date=10/09 14:02:18, total cpu=0:00:00.0, real=0:00:00.0, peak res=1452.3M, current mem=1452.3M)
Saving symbol-table file ...
Saving congestion map file top_cts.dat/top.route.congmap.gz ...
% Begin Save AAE data ... (date=10/09 14:02:18, mem=1452.7M)
Saving AAE Data ...
% End Save AAE data ... (date=10/09 14:02:18, total cpu=0:00:00.0, real=0:00:00.0, peak res=1452.7M, current mem=1452.7M)
Saving scheduling_file.cts.6189 in top_cts.dat/scheduling_file.cts
Saving preference file top_cts.dat/gui.pref.tcl ...
Saving mode setting ...
Saving global file ...
% Begin Save floorplan data ... (date=10/09 14:02:19, mem=1453.4M)
Saving floorplan file ...
% End Save floorplan data ... (date=10/09 14:02:19, total cpu=0:00:00.0, real=0:00:00.0, peak res=1453.6M, current mem=1453.6M)
Saving PG file top_cts.dat/top.pg.gz, version#2, (Created by Innovus v21.15-s110_1 on Thu Oct  9 14:02:19 2025)
*** Completed savePGFile (cpu=0:00:00.0 real=0:00:00.0 mem=1982.6M) ***
Saving Drc markers ...
... No Drc file written since there is no markers found.
% Begin Save placement data ... (date=10/09 14:02:19, mem=1453.6M)
** Saving stdCellPlacement_binary (version# 2) ...
Save Adaptive View Pruning View Names to Binary file
% End Save placement data ... (date=10/09 14:02:19, total cpu=0:00:00.0, real=0:00:00.0, peak res=1453.8M, current mem=1453.8M)
% Begin Save routing data ... (date=10/09 14:02:19, mem=1453.8M)
Saving route file ...
*** Completed saveRoute (cpu=0:00:00.0 real=0:00:00.0 mem=1982.6M) ***
% End Save routing data ... (date=10/09 14:02:19, total cpu=0:00:00.0, real=0:00:00.0, peak res=1454.0M, current mem=1454.0M)
Saving property file top_cts.dat/top.prop
*** Completed saveProperty (cpu=0:00:00.0 real=0:00:00.0 mem=1985.6M) ***
Saving rc congestion map top_cts.dat/top.congmap.gz ...
% Begin Save power constraints data ... (date=10/09 14:02:20, mem=1454.6M)
% End Save power constraints data ... (date=10/09 14:02:20, total cpu=0:00:00.0, real=0:00:00.0, peak res=1454.6M, current mem=1454.6M)
Generated self-contained design top_cts.dat
#% End save design ... (date=10/09 14:02:20, total cpu=0:00:00.4, real=0:00:02.0, peak res=1455.3M, current mem=1455.3M)
*** Message Summary: 0 warning(s), 0 error(s)

0
innovus 29> setAnalysisMode -analysisType onChipVariation -cppr both
innovus 30> setOptMode -fixCap true -fixTran true -fixFanoutLoad false
innovus 31> optDesign -postRoute
**optDesign ... cpu = 0:00:00, real = 0:00:00, mem = 1367.0M, totSessionCpu=0:02:27 **
**ERROR: (IMPOPT-608):	Design is not routed yet.
   _____________________________________________________________
  /  Design State
 +--------------------------------------------------------------
 | unconnected nets:        8
 | signal nets: 
 |    routed nets:        5 (11.9% routed)
 |     total nets:       42
 | clock nets: 
 |    routed nets:        0 (0.0% routed)
 |     total nets:        2
 +--------------------------------------------------------------
**INFO: Design is not detail routed
1
innovus 32> addFiller -cell feedth9 -prefix FILLER -doDRC
*INFO: Adding fillers to top-module.
*INFO:   Added 1898 filler insts (cell feedth9 / prefix FILLER).
*INFO: Total 1898 filler insts added - prefix FILLER (CPU: 0:00:00.1).
For 1898 new insts, *INFO: Filler mode add_fillers_with_drc is default true to avoid gaps, which may add fillers with violations. Please check the violations for FILLER_incr* fillers and fix them before routeDesign. Set it to false can avoid the violation but may leave gaps.
*INFO: Second pass addFiller without DRC checking.
*INFO: Adding fillers to top-module.
*INFO:   Added 0 filler inst of any cell-type.
innovus 33> addFiller -cell feedth3 -prefix FILLER -doDRC
*INFO: Adding fillers to top-module.
*INFO:   Added 83 filler insts (cell feedth3 / prefix FILLER).
*INFO: Total 83 filler insts added - prefix FILLER (CPU: 0:00:00.0).
For 83 new insts, *INFO: Filler mode add_fillers_with_drc is default true to avoid gaps, which may add fillers with violations. Please check the violations for FILLER_incr* fillers and fix them before routeDesign. Set it to false can avoid the violation but may leave gaps.
*INFO: Second pass addFiller without DRC checking.
*INFO: Adding fillers to top-module.
*INFO:   Added 0 filler inst of any cell-type.
innovus 34> addFiller -cell feedth -prefix FILLER -doDRC
*INFO: Adding fillers to top-module.
*INFO:   Added 153 filler insts (cell feedth / prefix FILLER).
*INFO: Total 153 filler insts added - prefix FILLER (CPU: 0:00:00.0).
For 153 new insts, innovus 35> saveDesign top_post_route_and_filler
#% Begin save design ... (date=10/09 14:04:06, mem=1375.3M)
% Begin Save ccopt configuration ... (date=10/09 14:04:06, mem=1375.3M)
% End Save ccopt configuration ... (date=10/09 14:04:06, total cpu=0:00:00.0, real=0:00:01.0, peak res=1375.3M, current mem=1375.3M)
% Begin Save netlist data ... (date=10/09 14:04:07, mem=1375.3M)
Writing Binary DB to top_post_route_and_filler.dat/top.v.bin in single-threaded mode...
% End Save netlist data ... (date=10/09 14:04:07, total cpu=0:00:00.0, real=0:00:00.0, peak res=1375.3M, current mem=1375.3M)
Saving symbol-table file ...
Saving congestion map file top_post_route_and_filler.dat/top.route.congmap.gz ...
% Begin Save AAE data ... (date=10/09 14:04:07, mem=1375.3M)
Saving AAE Data ...
AAE DB initialization (MEM=1953.18 CPU=0:00:00.0 REAL=0:00:00.0) 
% End Save AAE data ... (date=10/09 14:04:07, total cpu=0:00:00.0, real=0:00:00.0, peak res=1376.2M, current mem=1376.2M)
Saving scheduling_file.cts.6189 in top_post_route_and_filler.dat/scheduling_file.cts
Saving preference file top_post_route_and_filler.dat/gui.pref.tcl ...
Saving mode setting ...
Saving global file ...
% Begin Save floorplan data ... (date=10/09 14:04:07, mem=1376.5M)
Saving floorplan file ...
% End Save floorplan data ... (date=10/09 14:04:08, total cpu=0:00:00.0, real=0:00:01.0, peak res=1376.5M, current mem=1376.5M)
Saving PG file top_post_route_and_filler.dat/top.pg.gz, version#2, (Created by Innovus v21.15-s110_1 on Thu Oct  9 14:04:08 2025)
*** Completed savePGFile (cpu=0:00:00.0 real=0:00:00.0 mem=1952.7M) ***
Saving Drc markers ...
... No Drc file written since there is no markers found.
% Begin Save placement data ... (date=10/09 14:04:08, mem=1376.5M)
** Saving stdCellPlacement_binary (version# 2) ...
Save Adaptive View Pruning View Names to Binary file
% End Save placement data ... (date=10/09 14:04:08, total cpu=0:00:00.0, real=0:00:00.0, peak res=1376.5M, current mem=1376.5M)
% Begin Save routing data ... (date=10/09 14:04:08, mem=1376.5M)
Saving route file ...
*** Completed saveRoute (cpu=0:00:00.0 real=0:00:00.0 mem=1952.7M) ***
% End Save routing data ... (date=10/09 14:04:08, total cpu=0:00:00.0, real=0:00:00.0, peak res=1376.5M, current mem=1376.5M)
Saving property file top_post_route_and_filler.dat/top.prop
*** Completed saveProperty (cpu=0:00:00.0 real=0:00:00.0 mem=1955.7M) ***
Saving rc congestion map top_post_route_and_filler.dat/top.congmap.gz ...
% Begin Save power constraints data ... (date=10/09 14:04:08, mem=1376.5M)
% End Save power constraints data ... (date=10/09 14:04:08, total cpu=0:00:00.0, real=0:00:00.0, peak res=1376.5M, current mem=1376.5M)
Generated self-contained design top_post_route_and_filler.dat
#% End save design ... (date=10/09 14:04:08, total cpu=0:00:00.4, real=0:00:03.0, peak res=1376.5M, current mem=1376.5M)
*** Message Summary: 0 warning(s), 0 error(s)

0
innovus 36> streamOut Top_FINAL.gds -mapFile /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/tech_data/lef/gds2_fe_4l.map -libName DesignLib -merge {/home/vlsi12/Downloads/scl_pdk/stdlib/fs120/gds/tsl18fs120.gds /home/vlsi12/Downloads/scl_pdk/iolib/cio150/gds/tsl18cio150_4lm.gds} -uniquifyCellNames -units 1000 -mode ALL
Merge file: /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/gds/tsl18fs120.gds has version number: 5
Merge file: /home/vlsi12/Downloads/scl_pdk/iolib/cio150/gds/tsl18cio150_4lm.gds has version number: 5
Parse flat map file...
Writing GDSII file ...
	****** db unit per micron = 1000 ******
	****** output gds2 file unit per micron = 1000 ******
	****** unit scaling factor = 1 ******
Output for instance
Output for bump
Output for physical terminals
Output for logical terminals
Output for regular nets
Output for special nets and metal fills
Output for via structure generation total number 26
Statistics for GDS generated (version 5)
----------------------------------------
Stream Out Layer Mapping Information:
GDS Layer Number          GDS Layer Name
----------------------------------------
    50                             TOP_M
    44                                M3
    42                                M2
    40                                M1
    49                             TOP_V
    41                                V2
    43                                V3


Stream Out Information Processed for GDS version 5:
Units: 1000 DBU

Object                             Count
----------------------------------------
Instances                           2238

Ports/Pins                             0

Nets                                 242
    metal layer M2                   112
    metal layer M3                   127
    metal layer TOP_M                  3

    Via Instances                    345

Special Nets                         257
    metal layer M1                   131
    metal layer M2                    24
    metal layer M3                    62
    metal layer TOP_M                 40

    Via Instances                   1059

Metal Fills                            0

    Via Instances                      0

Metal FillOPCs                         0

    Via Instances                      0

Metal FillDRCs                         0

    Via Instances                      0

Text                                  52
    metal layer M2                    33
    metal layer M3                    19


Blockages                              0


Custom Text                            0


Custom Box                             0

Trim Metal                             0

Scanning GDS file /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/gds/tsl18fs120.gds to register cell name ......
Scanning GDS file /home/vlsi12/Downloads/scl_pdk/iolib/cio150/gds/tsl18cio150_4lm.gds to register cell name ......
Merging GDS file /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/gds/tsl18fs120.gds ......
	****** Merge file: /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/gds/tsl18fs120.gds has version number: 5.
	****** Merge file: /home/vlsi12/Downloads/scl_pdk/stdlib/fs120/gds/tsl18fs120.gds has units: 1000 per micron.
	****** unit scaling factor = 1 ******
Merging GDS file /home/vlsi12/Downloads/scl_pdk/iolib/cio150/gds/tsl18cio150_4lm.gds ......
	****** Merge file: /home/vlsi12/Downloads/scl_pdk/iolib/cio150/gds/tsl18cio150_4lm.gds has version number: 5.
	****** Merge file: /home/vlsi12/Downloads/scl_pdk/iolib/cio150/gds/tsl18cio150_4lm.gds has units: 1000 per micron.
	****** unit scaling factor = 1 ******
**WARN: (IMPOGDS-217):	Master cell: pc3d01 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: dfcrn1 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: oaim22d1 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: decrq1 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: dfcrq1 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: inv0d0 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: aoim22d1 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: feedth9 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: dfcrb4 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: buffd1 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: inv0d2 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: nr03d1 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: decrq4 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: dfcrq4 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: feedth not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: pfeed01000 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: pc3c01 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: pfrelr not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: aoi211d1 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (IMPOGDS-217):	Master cell: feedth3 not found in merged file(s) and will therefore not be included in the resulting streamOut file. Verify the file names specified with the -merge option are correct and that they contain a definition of this cell.
**WARN: (EMS-27):	Message (IMPOGDS-217) has exceeded the current message display limit of 20.
To increase the message display limit, refer to the product command reference manual.
**WARN: (IMPOGDS-218):	Number of master cells not found after merging: 31

######Streamout is finished!
innovus 37> #% Begin save design ... (date=10/09 14:05:45, mem=1381.3M)
% Begin Save ccopt configuration ... (date=10/09 14:05:45, mem=1381.3M)
% End Save ccopt configuration ... (date=10/09 14:05:45, total cpu=0:00:00.0, real=0:00:00.0, peak res=1381.3M, current mem=1381.3M)
% Begin Save netlist data ... (date=10/09 14:05:45, mem=1381.3M)
Writing Binary DB to top_final.enc.dat/top.v.bin in single-threaded mode...
% End Save netlist data ... (date=10/09 14:05:45, total cpu=0:00:00.0, real=0:00:00.0, peak res=1381.3M, current mem=1381.3M)
Saving symbol-table file ...
Saving congestion map file top_final.enc.dat/top.route.congmap.gz ...
% Begin Save AAE data ... (date=10/09 14:05:46, mem=1381.3M)
Saving AAE Data ...
% End Save AAE data ... (date=10/09 14:05:46, total cpu=0:00:00.0, real=0:00:00.0, peak res=1381.3M, current mem=1381.3M)
Saving scheduling_file.cts.6189 in top_final.enc.dat/scheduling_file.cts
Saving preference file top_final.enc.dat/gui.pref.tcl ...
Saving mode setting ...
Saving global file ...
% Begin Save floorplan data ... (date=10/09 14:05:46, mem=1381.3M)
Saving floorplan file ...
% End Save floorplan data ... (date=10/09 14:05:46, total cpu=0:00:00.0, real=0:00:00.0, peak res=1381.3M, current mem=1381.3M)
Saving PG file top_final.enc.dat/top.pg.gz, version#2, (Created by Innovus v21.15-s110_1 on Thu Oct  9 14:05:46 2025)
*** Completed savePGFile (cpu=0:00:00.0 real=0:00:00.0 mem=1953.3M) ***
Saving Drc markers ...
... No Drc file written since there is no markers found.
% Begin Save placement data ... (date=10/09 14:05:46, mem=1381.3M)
** Saving stdCellPlacement_binary (version# 2) ...
Save Adaptive View Pruning View Names to Binary file
% End Save placement data ... (date=10/09 14:05:46, total cpu=0:00:00.0, real=0:00:00.0, peak res=1381.3M, current mem=1381.3M)
% Begin Save routing data ... (date=10/09 14:05:46, mem=1381.3M)
Saving route file ...
*** Completed saveRoute (cpu=0:00:00.0 real=0:00:01.0 mem=1953.3M) ***
% End Save routing data ... (date=10/09 14:05:47, total cpu=0:00:00.0, real=0:00:01.0, peak res=1381.3M, current mem=1381.3M)
Saving property file top_final.enc.dat/top.prop
*** Completed saveProperty (cpu=0:00:00.0 real=0:00:00.0 mem=1956.3M) ***
Saving rc congestion map top_final.enc.dat/top.congmap.gz ...
% Begin Save power constraints data ... (date=10/09 14:05:47, mem=1381.3M)
% End Save power constraints data ... (date=10/09 14:05:47, total cpu=0:00:00.0, real=0:00:00.0, peak res=1381.3M, current mem=1381.3M)
Generated self-contained design top_final.enc.dat
#% End save design ... (date=10/09 14:05:47, total cpu=0:00:00.4, real=0:00:02.0, peak res=1381.4M, current mem=1381.4M)
*** Message Summary: 0 warning(s), 0 error(s)


