setPlaceMode -fp false
placeDesign -noPrePlaceOpt
saveDesign top_placement
